nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_cm33_core1.h
#define __MPU_PRESENT                  1         /**< Defines if an MPU is present or not */
#define __NVIC_PRIO_BITS               3         /**< Number of priority bits implemented in the NVIC */
#define __Vendor_SysTickConfig         0         /**< Vendor specific implementation of SysTickConfig is defined */
#define __FPU_PRESENT                  1         /**< Defines if an FPU is present or not */
#define __DSP_PRESENT                  1         /**< Defines if Armv8-M Mainline core supports DSP instructions */
#define __SAUREGION_PRESENT            1         /**< Defines if an SAU is present or not */

#include "core_cm33.h"                 /* Core Peripheral Access Layer */
#include "system_MIMXRT735S_cm33_core1.h" /* Device specific configuration file */

/*!
 * @}
 */ /* end of group Cortex_Core_Configuration */


/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Mapping_Information Mapping Information
 * @{
 */

/** Mapping Information */
/*!
 * @addtogroup edma_request
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*!
 * @brief Structure for the DMA hardware request
 *
 * Defines the structure for the DMA hardware request collections.
 */
typedef enum _dma_request_source
{
    kDmaRequestMuxDisabled          = 0U,          /**< Unused DMA request 0 */
    kDmaRequestMuxMicfil            = 1U,          /**< MICFIL0 FIFO_request */
    kDmaRequestMuxXspi2Rx           = 2U,          /**< XSPI2 Receive */
    kDmaRequestMuxXspi2Tx           = 3U,          /**< XSPI2 Transmit */
    kDmaRequestMuxPinInt0           = 4U,          /**< PINT1 INT0 */
    kDmaRequestMuxPinInt1           = 5U,          /**< PINT1 INT1 */
    kDmaRequestMuxPinInt2           = 6U,          /**< PINT1 INT2 */
    kDmaRequestMuxPinInt3           = 7U,          /**< PINT1 INT3 */
    kDmaRequestMuxCtimer5M0         = 8U,          /**< CTIMER5 Match channel 0 request */
    kDmaRequestMuxCtimer5M1         = 9U,          /**< CTIMER5 Match channel 1 request */
    kDmaRequestMuxCtimer6M0         = 10U,         /**< CTIMER6 Match channel 0 request */
    kDmaRequestMuxCtimer6M1         = 11U,         /**< CTIMER6 Match channel 1 request */
    kDmaRequestMuxCtimer7M0         = 12U,         /**< CTIMER7 Match channel 0 request */
    kDmaRequestMuxCtimer7M1         = 13U,         /**< CTIMER7 Match channel 1 request */
    kDmaRequestMuxAdc0FifoARequest  = 14U,         /**< ADC0 FIFO A request */
    kDmaRequestMuxAdc0FifoBRequest  = 15U,         /**< ADC0 FIFO B request */
    kDmaRequestMuxSdAdcFifo0Request = 16U,         /**< SDADC0 FIFO 0 request */
    kDmaRequestMuxSdAdcFifo1Request = 17U,         /**< SDADC0 FIFO 1 request */
    kDmaRequestMuxSdAdcFifo2Request = 18U,         /**< SDADC0 FIFO 2 request */
    kDmaRequestMuxSdAdcFifo3Request = 19U,         /**< SDADC0 FIFO 3 request */
    kDmaRequestMuxCmpDmaRequest     = 20U,         /**< CMP DMA request */
    kDmaRequestMuxReserved21        = 21U,         /**< Reserved 21 */
    kDmaRequestMuxReserved22        = 22U,         /**< Reserved 22 */
    kDmaRequestMuxFlexIO0ShiftRegister0Request = 23U, /**< FlexIO0 Shifter0 Status DMA request OR Timer0 Status DMA request */
    kDmaRequestMuxFlexIO0ShiftRegister1Request = 24U, /**< FlexIO0 Shifter1 Status DMA request OR Timer1 Status DMA request */
    kDmaRequestMuxFlexIO0ShiftRegister2Request = 25U, /**< FlexIO0 Shifter2 Status DMA request OR Timer2 Status DMA request */
    kDmaRequestMuxFlexIO0ShiftRegister3Request = 26U, /**< FlexIO0 Shifter3 Status DMA request OR Timer3 Status DMA request */
    kDmaRequestMuxFlexIO0ShiftRegister4Request = 27U, /**< FlexIO0 Shifter4 Status DMA request OR Timer4 Status DMA request */
    kDmaRequestMuxFlexIO0ShiftRegister5Request = 28U, /**< FlexIO0 Shifter5 Status DMA request OR Timer5 Status DMA request */
    kDmaRequestMuxFlexIO0ShiftRegister6Request = 29U, /**< FlexIO0 Shifter6 Status DMA request OR Timer6 Status DMA request */
    kDmaRequestMuxFlexIO0ShiftRegister7Request = 30U, /**< FlexIO0 Shifter7 Status DMA request OR Timer7 Status DMA request */
    kDmaRequestMuxLpFlexcomm17Rx    = 31U,         /**< LP_FLEXCOMM17 Receive request */
    kDmaRequestMuxLpFlexcomm17Tx    = 32U,         /**< LP_FLEXCOMM17 Transmit request */
    kDmaRequestMuxLpFlexcomm18Rx    = 33U,         /**< LP_FLEXCOMM18 Receive request */
    kDmaRequestMuxLpFlexcomm18Tx    = 34U,         /**< LP_FLEXCOMM18 Transmit request */
    kDmaRequestMuxLpFlexcomm19Rx    = 35U,         /**< LP_FLEXCOMM19 Receive request */
    kDmaRequestMuxLpFlexcomm19Tx    = 36U,         /**< LP_FLEXCOMM19 Transmit request */
    kDmaRequestMuxLpFlexcomm20Rx    = 37U,         /**< LP_FLEXCOMM20 Receive request */
    kDmaRequestMuxLpFlexcomm20Tx    = 38U,         /**< LP_FLEXCOMM20 Transmit request */
    kDmaRequestMuxI3c2Tx            = 39U,         /**< I3C2 Transmit request */
    kDmaRequestMuxI3c2Rx            = 40U,         /**< I3C2 Receive request */
    kDmaRequestMuxI3c3Tx            = 41U,         /**< I3C3 Transmit request */
    kDmaRequestMuxI3c3Rx            = 42U,         /**< I3C3 Receive request */
    kDmaRequestMuxSai3Rx            = 43U,         /**< SAI3 Receive request */
    kDmaRequestMuxSai3Tx            = 44U,         /**< SAI3 Transmit request */
    kDmaRequestMuxGpio8PinEventRequest0 = 45U,     /**< GPIO8 Pin event request 0 */
    kDmaRequestMuxGpio8PinEventRequest1 = 46U,     /**< GPIO8 Pin event request 1 */
    kDmaRequestMuxGpio9PinEventRequest0 = 47U,     /**< GPIO9 Pin event request 0 */
    kDmaRequestMuxGpio9PinEventRequest1 = 48U,     /**< GPIO9 Pin event request 1 */
    kDmaRequestMuxGpio10PinEventRequest0 = 49U,    /**< GPIO10 Pin event request 0 */
    kDmaRequestMuxGpio10PinEventRequest1 = 50U,    /**< GPIO10 Pin event request 1 */
    kDmaRequestMuxLpi2c15Rx         = 51U,         /**< LPI2C receive request */
    kDmaRequestMuxLpi2c15Tx         = 52U,         /**< LPI2C transmit request */
} dma_request_source_t;

/* @} */


/*!
 * @}
 */ /* end of group Mapping_Information */


/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


