nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_cm33_core1.h
#define CLKCTL3_SENSERAMCLKDIV_REQFLAG_MASK      (0x80000000U)
#define CLKCTL3_SENSERAMCLKDIV_REQFLAG_SHIFT     (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL3_SENSERAMCLKDIV_REQFLAG(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL3_SENSERAMCLKDIV_REQFLAG_SHIFT)) & CLKCTL3_SENSERAMCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name OSTIMERFCLKSEL - OSTIMER Functional Clock Source Select */
/*! @{ */

#define CLKCTL3_OSTIMERFCLKSEL_SEL_MASK          (0x3U)
#define CLKCTL3_OSTIMERFCLKSEL_SEL_SHIFT         (0U)
/*! SEL - Clock Source Select
 *  0b00..baseclk_sense
 *  0b01..wake32k_clk
 *  0b10..1m_lposc
 *  0b11..osc_clk
 */
#define CLKCTL3_OSTIMERFCLKSEL_SEL(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL3_OSTIMERFCLKSEL_SEL_SHIFT)) & CLKCTL3_OSTIMERFCLKSEL_SEL_MASK)

#define CLKCTL3_OSTIMERFCLKSEL_SEL_EN_MASK       (0x4U)
#define CLKCTL3_OSTIMERFCLKSEL_SEL_EN_SHIFT      (2U)
/*! SEL_EN - Clock MUX Output Enable
 *  0b0..Gates output of clock mux.
 *  0b1..Enables output of clock mux.
 */
#define CLKCTL3_OSTIMERFCLKSEL_SEL_EN(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL3_OSTIMERFCLKSEL_SEL_EN_SHIFT)) & CLKCTL3_OSTIMERFCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name OSTIMERFCLKDIV - OSTIMER Functional Clock Divider */
/*! @{ */

#define CLKCTL3_OSTIMERFCLKDIV_DIV_MASK          (0xFFU)
#define CLKCTL3_OSTIMERFCLKDIV_DIV_SHIFT         (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL3_OSTIMERFCLKDIV_DIV(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL3_OSTIMERFCLKDIV_DIV_SHIFT)) & CLKCTL3_OSTIMERFCLKDIV_DIV_MASK)

#define CLKCTL3_OSTIMERFCLKDIV_BUSY_MASK         (0x10000000U)
#define CLKCTL3_OSTIMERFCLKDIV_BUSY_SHIFT        (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL3_OSTIMERFCLKDIV_BUSY(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL3_OSTIMERFCLKDIV_BUSY_SHIFT)) & CLKCTL3_OSTIMERFCLKDIV_BUSY_MASK)

#define CLKCTL3_OSTIMERFCLKDIV_RESET_MASK        (0x20000000U)
#define CLKCTL3_OSTIMERFCLKDIV_RESET_SHIFT       (29U)
/*! RESET - Divider Counter Reset
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL3_OSTIMERFCLKDIV_RESET(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL3_OSTIMERFCLKDIV_RESET_SHIFT)) & CLKCTL3_OSTIMERFCLKDIV_RESET_MASK)

#define CLKCTL3_OSTIMERFCLKDIV_HALT_MASK         (0x40000000U)
#define CLKCTL3_OSTIMERFCLKDIV_HALT_SHIFT        (30U)
/*! HALT - Divider Counter Halt
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL3_OSTIMERFCLKDIV_HALT(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL3_OSTIMERFCLKDIV_HALT_SHIFT)) & CLKCTL3_OSTIMERFCLKDIV_HALT_MASK)

#define CLKCTL3_OSTIMERFCLKDIV_REQFLAG_MASK      (0x80000000U)
#define CLKCTL3_OSTIMERFCLKDIV_REQFLAG_SHIFT     (31U)
/*! REQFLAG - Request Flag
 *  0b0..The divider change has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL3_OSTIMERFCLKDIV_REQFLAG(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL3_OSTIMERFCLKDIV_REQFLAG_SHIFT)) & CLKCTL3_OSTIMERFCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name SDADCFCLKSEL - SDADC Functional Clock Source Select */
/*! @{ */

#define CLKCTL3_SDADCFCLKSEL_SEL_MASK            (0x3U)
#define CLKCTL3_SDADCFCLKSEL_SEL_SHIFT           (0U)
/*! SEL - SDADC Functional Clock Source Select
 *  0b00..baseclk_sense
 *  0b01..fro2_div8
 *  0b10..audio_pll_vco
 *  0b11..audio_clk
 */
#define CLKCTL3_SDADCFCLKSEL_SEL(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL3_SDADCFCLKSEL_SEL_SHIFT)) & CLKCTL3_SDADCFCLKSEL_SEL_MASK)

#define CLKCTL3_SDADCFCLKSEL_SEL_EN_MASK         (0x4U)
#define CLKCTL3_SDADCFCLKSEL_SEL_EN_SHIFT        (2U)
/*! SEL_EN - Clock MUX Output Enable
 *  0b0..Gates output of clock mux.
 *  0b1..Enables output of clock mux.
 */
#define CLKCTL3_SDADCFCLKSEL_SEL_EN(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL3_SDADCFCLKSEL_SEL_EN_SHIFT)) & CLKCTL3_SDADCFCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name SDADCFCLKDIV - SDADC Functional Clock Divider */
/*! @{ */

#define CLKCTL3_SDADCFCLKDIV_DIV_MASK            (0xFFU)
#define CLKCTL3_SDADCFCLKDIV_DIV_SHIFT           (0U)
/*! DIV - Clock Divider Value Selection */
#define CLKCTL3_SDADCFCLKDIV_DIV(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL3_SDADCFCLKDIV_DIV_SHIFT)) & CLKCTL3_SDADCFCLKDIV_DIV_MASK)

#define CLKCTL3_SDADCFCLKDIV_BUSY_MASK           (0x10000000U)
#define CLKCTL3_SDADCFCLKDIV_BUSY_SHIFT          (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL3_SDADCFCLKDIV_BUSY(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL3_SDADCFCLKDIV_BUSY_SHIFT)) & CLKCTL3_SDADCFCLKDIV_BUSY_MASK)

#define CLKCTL3_SDADCFCLKDIV_RESET_MASK          (0x20000000U)
#define CLKCTL3_SDADCFCLKDIV_RESET_SHIFT         (29U)
/*! RESET - Divider Counter Reset
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL3_SDADCFCLKDIV_RESET(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL3_SDADCFCLKDIV_RESET_SHIFT)) & CLKCTL3_SDADCFCLKDIV_RESET_MASK)

#define CLKCTL3_SDADCFCLKDIV_HALT_MASK           (0x40000000U)
#define CLKCTL3_SDADCFCLKDIV_HALT_SHIFT          (30U)
/*! HALT - Divider Counter Halt
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL3_SDADCFCLKDIV_HALT(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL3_SDADCFCLKDIV_HALT_SHIFT)) & CLKCTL3_SDADCFCLKDIV_HALT_MASK)

#define CLKCTL3_SDADCFCLKDIV_REQFLAG_MASK        (0x80000000U)
#define CLKCTL3_SDADCFCLKDIV_REQFLAG_SHIFT       (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL3_SDADCFCLKDIV_REQFLAG(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL3_SDADCFCLKDIV_REQFLAG_SHIFT)) & CLKCTL3_SDADCFCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name SARADCFCLKSEL - ADC0 (SARADC) Functional Clock Source Select */
/*! @{ */

#define CLKCTL3_SARADCFCLKSEL_SEL_MASK           (0x3U)
#define CLKCTL3_SARADCFCLKSEL_SEL_SHIFT          (0U)
/*! SEL - Clock Source Select
 *  0b00..baseclk_sense
 *  0b01..main_pll_pfd1
 *  0b10..fro2_max
 *  0b11..osc_clk
 */
#define CLKCTL3_SARADCFCLKSEL_SEL(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL3_SARADCFCLKSEL_SEL_SHIFT)) & CLKCTL3_SARADCFCLKSEL_SEL_MASK)

#define CLKCTL3_SARADCFCLKSEL_SEL_EN_MASK        (0x4U)
#define CLKCTL3_SARADCFCLKSEL_SEL_EN_SHIFT       (2U)
/*! SEL_EN - Clock MUX Output Enable
 *  0b0..Gates output of clock mux.
 *  0b1..Enables output of clock mux.
 */
#define CLKCTL3_SARADCFCLKSEL_SEL_EN(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL3_SARADCFCLKSEL_SEL_EN_SHIFT)) & CLKCTL3_SARADCFCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name SARADCFCLKDIV - ADC0 (SARADC) Functional Clock Divider */
/*! @{ */

#define CLKCTL3_SARADCFCLKDIV_DIV_MASK           (0xFFU)
#define CLKCTL3_SARADCFCLKDIV_DIV_SHIFT          (0U)
/*! DIV - Clock Divider Value Selection */
#define CLKCTL3_SARADCFCLKDIV_DIV(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL3_SARADCFCLKDIV_DIV_SHIFT)) & CLKCTL3_SARADCFCLKDIV_DIV_MASK)

#define CLKCTL3_SARADCFCLKDIV_BUSY_MASK          (0x10000000U)
#define CLKCTL3_SARADCFCLKDIV_BUSY_SHIFT         (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL3_SARADCFCLKDIV_BUSY(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL3_SARADCFCLKDIV_BUSY_SHIFT)) & CLKCTL3_SARADCFCLKDIV_BUSY_MASK)

#define CLKCTL3_SARADCFCLKDIV_RESET_MASK         (0x20000000U)
#define CLKCTL3_SARADCFCLKDIV_RESET_SHIFT        (29U)
/*! RESET - Divider Counter Reset
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL3_SARADCFCLKDIV_RESET(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL3_SARADCFCLKDIV_RESET_SHIFT)) & CLKCTL3_SARADCFCLKDIV_RESET_MASK)

#define CLKCTL3_SARADCFCLKDIV_HALT_MASK          (0x40000000U)
#define CLKCTL3_SARADCFCLKDIV_HALT_SHIFT         (30U)
/*! HALT - Divider Counter Halt
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL3_SARADCFCLKDIV_HALT(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL3_SARADCFCLKDIV_HALT_SHIFT)) & CLKCTL3_SARADCFCLKDIV_HALT_MASK)

#define CLKCTL3_SARADCFCLKDIV_REQFLAG_MASK       (0x80000000U)
#define CLKCTL3_SARADCFCLKDIV_REQFLAG_SHIFT      (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL3_SARADCFCLKDIV_REQFLAG(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL3_SARADCFCLKDIV_REQFLAG_SHIFT)) & CLKCTL3_SARADCFCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name WAKE32KCLKSEL - Wake 32 kHZ Clock Source Select */
/*! @{ */

#define CLKCTL3_WAKE32KCLKSEL_SEL_MASK           (0x3U)
#define CLKCTL3_WAKE32KCLKSEL_SEL_SHIFT          (0U)
/*! SEL - Clock Source Select
 *  0b00..osc_32k
 *  0b01..lp_32k (1m_lposc clock divided by 32)
 *  0b10..Reserved
 *  0b11..Tied to logic 0. This may be selected to reduce power when no output is needed.
 */
#define CLKCTL3_WAKE32KCLKSEL_SEL(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL3_WAKE32KCLKSEL_SEL_SHIFT)) & CLKCTL3_WAKE32KCLKSEL_SEL_MASK)
/*! @} */

/*! @name WAKE32KCLKDIV - Wake 32kHZ Clock Divider */
/*! @{ */

#define CLKCTL3_WAKE32KCLKDIV_DIV_MASK           (0xFFU)
#define CLKCTL3_WAKE32KCLKDIV_DIV_SHIFT          (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL3_WAKE32KCLKDIV_DIV(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL3_WAKE32KCLKDIV_DIV_SHIFT)) & CLKCTL3_WAKE32KCLKDIV_DIV_MASK)

#define CLKCTL3_WAKE32KCLKDIV_BUSY_MASK          (0x10000000U)
#define CLKCTL3_WAKE32KCLKDIV_BUSY_SHIFT         (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL3_WAKE32KCLKDIV_BUSY(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL3_WAKE32KCLKDIV_BUSY_SHIFT)) & CLKCTL3_WAKE32KCLKDIV_BUSY_MASK)

#define CLKCTL3_WAKE32KCLKDIV_RESET_MASK         (0x20000000U)
#define CLKCTL3_WAKE32KCLKDIV_RESET_SHIFT        (29U)
/*! RESET - Divider Counter Reset
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL3_WAKE32KCLKDIV_RESET(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL3_WAKE32KCLKDIV_RESET_SHIFT)) & CLKCTL3_WAKE32KCLKDIV_RESET_MASK)

#define CLKCTL3_WAKE32KCLKDIV_HALT_MASK          (0x40000000U)
#define CLKCTL3_WAKE32KCLKDIV_HALT_SHIFT         (30U)
/*! HALT - Divider Counter Halt
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL3_WAKE32KCLKDIV_HALT(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL3_WAKE32KCLKDIV_HALT_SHIFT)) & CLKCTL3_WAKE32KCLKDIV_HALT_MASK)

#define CLKCTL3_WAKE32KCLKDIV_REQFLAG_MASK       (0x80000000U)
#define CLKCTL3_WAKE32KCLKDIV_REQFLAG_SHIFT      (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL3_WAKE32KCLKDIV_REQFLAG(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL3_WAKE32KCLKDIV_REQFLAG_SHIFT)) & CLKCTL3_WAKE32KCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name MICFILFCLKSEL - MICFIL Functional Clock Source Select */
/*! @{ */

#define CLKCTL3_MICFILFCLKSEL_SEL_MASK           (0x3U)
#define CLKCTL3_MICFILFCLKSEL_SEL_SHIFT          (0U)
/*! SEL - Clock Source Select
 *  0b00..baseclk_sense
 *  0b01..audio_pll_pfd3
 *  0b10..fro2_max
 *  0b11..audio_clk
 */
#define CLKCTL3_MICFILFCLKSEL_SEL(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL3_MICFILFCLKSEL_SEL_SHIFT)) & CLKCTL3_MICFILFCLKSEL_SEL_MASK)

#define CLKCTL3_MICFILFCLKSEL_SEL_EN_MASK        (0x4U)
#define CLKCTL3_MICFILFCLKSEL_SEL_EN_SHIFT       (2U)
/*! SEL_EN - Clock MUX Output Enable
 *  0b0..Gates output of clock mux.
 *  0b1..Enables output of clock mux.
 */
#define CLKCTL3_MICFILFCLKSEL_SEL_EN(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL3_MICFILFCLKSEL_SEL_EN_SHIFT)) & CLKCTL3_MICFILFCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name MICFILFCLKDIV - MICFIL Functional Clock Divider */
/*! @{ */

#define CLKCTL3_MICFILFCLKDIV_DIV_MASK           (0xFFU)
#define CLKCTL3_MICFILFCLKDIV_DIV_SHIFT          (0U)
/*! DIV - Clock Divider Value */
#define CLKCTL3_MICFILFCLKDIV_DIV(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL3_MICFILFCLKDIV_DIV_SHIFT)) & CLKCTL3_MICFILFCLKDIV_DIV_MASK)

#define CLKCTL3_MICFILFCLKDIV_BUSY_MASK          (0x10000000U)
#define CLKCTL3_MICFILFCLKDIV_BUSY_SHIFT         (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL3_MICFILFCLKDIV_BUSY(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL3_MICFILFCLKDIV_BUSY_SHIFT)) & CLKCTL3_MICFILFCLKDIV_BUSY_MASK)

#define CLKCTL3_MICFILFCLKDIV_RESET_MASK         (0x20000000U)
#define CLKCTL3_MICFILFCLKDIV_RESET_SHIFT        (29U)
/*! RESET - Divider Counter Reset
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL3_MICFILFCLKDIV_RESET(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL3_MICFILFCLKDIV_RESET_SHIFT)) & CLKCTL3_MICFILFCLKDIV_RESET_MASK)

#define CLKCTL3_MICFILFCLKDIV_HALT_MASK          (0x40000000U)
#define CLKCTL3_MICFILFCLKDIV_HALT_SHIFT         (30U)
/*! HALT - Divider Counter Halt
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL3_MICFILFCLKDIV_HALT(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL3_MICFILFCLKDIV_HALT_SHIFT)) & CLKCTL3_MICFILFCLKDIV_HALT_MASK)

#define CLKCTL3_MICFILFCLKDIV_REQFLAG_MASK       (0x80000000U)
#define CLKCTL3_MICFILFCLKDIV_REQFLAG_SHIFT      (31U)
/*! REQFLAG - Request Flag
 *  0b0..The divider change has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL3_MICFILFCLKDIV_REQFLAG(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL3_MICFILFCLKDIV_REQFLAG_SHIFT)) & CLKCTL3_MICFILFCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name LPI2C15FCLKSEL - LPI2C15 Functional Clock Source Select */
/*! @{ */

