nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_cm33_core1.h
#define RGPIO_ISFR_ISF17_MASK                     (0x20000U)
#define RGPIO_ISFR_ISF17_SHIFT                    (17U)
/*! ISF17 - Interrupt Status Flag
 *  0b0..Not detected
 *  0b1..Detected
 *  0b0..No effect
 *  0b1..Clear the flag
 */
#define RGPIO_ISFR_ISF17(x)                       (((uint32_t)(((uint32_t)(x)) << RGPIO_ISFR_ISF17_SHIFT)) & RGPIO_ISFR_ISF17_MASK)

#define RGPIO_ISFR_ISF18_MASK                     (0x40000U)
#define RGPIO_ISFR_ISF18_SHIFT                    (18U)
/*! ISF18 - Interrupt Status Flag
 *  0b0..Not detected
 *  0b1..Detected
 *  0b0..No effect
 *  0b1..Clear the flag
 */
#define RGPIO_ISFR_ISF18(x)                       (((uint32_t)(((uint32_t)(x)) << RGPIO_ISFR_ISF18_SHIFT)) & RGPIO_ISFR_ISF18_MASK)

#define RGPIO_ISFR_ISF19_MASK                     (0x80000U)
#define RGPIO_ISFR_ISF19_SHIFT                    (19U)
/*! ISF19 - Interrupt Status Flag
 *  0b0..Not detected
 *  0b1..Detected
 *  0b0..No effect
 *  0b1..Clear the flag
 */
#define RGPIO_ISFR_ISF19(x)                       (((uint32_t)(((uint32_t)(x)) << RGPIO_ISFR_ISF19_SHIFT)) & RGPIO_ISFR_ISF19_MASK)

#define RGPIO_ISFR_ISF20_MASK                     (0x100000U)
#define RGPIO_ISFR_ISF20_SHIFT                    (20U)
/*! ISF20 - Interrupt Status Flag
 *  0b0..Not detected
 *  0b1..Detected
 *  0b0..No effect
 *  0b1..Clear the flag
 */
#define RGPIO_ISFR_ISF20(x)                       (((uint32_t)(((uint32_t)(x)) << RGPIO_ISFR_ISF20_SHIFT)) & RGPIO_ISFR_ISF20_MASK)

#define RGPIO_ISFR_ISF21_MASK                     (0x200000U)
#define RGPIO_ISFR_ISF21_SHIFT                    (21U)
/*! ISF21 - Interrupt Status Flag
 *  0b0..Not detected
 *  0b1..Detected
 *  0b0..No effect
 *  0b1..Clear the flag
 */
#define RGPIO_ISFR_ISF21(x)                       (((uint32_t)(((uint32_t)(x)) << RGPIO_ISFR_ISF21_SHIFT)) & RGPIO_ISFR_ISF21_MASK)

#define RGPIO_ISFR_ISF22_MASK                     (0x400000U)
#define RGPIO_ISFR_ISF22_SHIFT                    (22U)
/*! ISF22 - Interrupt Status Flag
 *  0b0..Not detected
 *  0b1..Detected
 *  0b0..No effect
 *  0b1..Clear the flag
 */
#define RGPIO_ISFR_ISF22(x)                       (((uint32_t)(((uint32_t)(x)) << RGPIO_ISFR_ISF22_SHIFT)) & RGPIO_ISFR_ISF22_MASK)

#define RGPIO_ISFR_ISF23_MASK                     (0x800000U)
#define RGPIO_ISFR_ISF23_SHIFT                    (23U)
/*! ISF23 - Interrupt Status Flag
 *  0b0..Not detected
 *  0b1..Detected
 *  0b0..No effect
 *  0b1..Clear the flag
 */
#define RGPIO_ISFR_ISF23(x)                       (((uint32_t)(((uint32_t)(x)) << RGPIO_ISFR_ISF23_SHIFT)) & RGPIO_ISFR_ISF23_MASK)

#define RGPIO_ISFR_ISF24_MASK                     (0x1000000U)
#define RGPIO_ISFR_ISF24_SHIFT                    (24U)
/*! ISF24 - Interrupt Status Flag
 *  0b0..Not detected
 *  0b1..Detected
 *  0b0..No effect
 *  0b1..Clear the flag
 */
#define RGPIO_ISFR_ISF24(x)                       (((uint32_t)(((uint32_t)(x)) << RGPIO_ISFR_ISF24_SHIFT)) & RGPIO_ISFR_ISF24_MASK)

#define RGPIO_ISFR_ISF25_MASK                     (0x2000000U)
#define RGPIO_ISFR_ISF25_SHIFT                    (25U)
/*! ISF25 - Interrupt Status Flag
 *  0b0..Not detected
 *  0b1..Detected
 *  0b0..No effect
 *  0b1..Clear the flag
 */
#define RGPIO_ISFR_ISF25(x)                       (((uint32_t)(((uint32_t)(x)) << RGPIO_ISFR_ISF25_SHIFT)) & RGPIO_ISFR_ISF25_MASK)

#define RGPIO_ISFR_ISF26_MASK                     (0x4000000U)
#define RGPIO_ISFR_ISF26_SHIFT                    (26U)
/*! ISF26 - Interrupt Status Flag
 *  0b0..Not detected
 *  0b1..Detected
 *  0b0..No effect
 *  0b1..Clear the flag
 */
#define RGPIO_ISFR_ISF26(x)                       (((uint32_t)(((uint32_t)(x)) << RGPIO_ISFR_ISF26_SHIFT)) & RGPIO_ISFR_ISF26_MASK)

#define RGPIO_ISFR_ISF27_MASK                     (0x8000000U)
#define RGPIO_ISFR_ISF27_SHIFT                    (27U)
/*! ISF27 - Interrupt Status Flag
 *  0b0..Not detected
 *  0b1..Detected
 *  0b0..No effect
 *  0b1..Clear the flag
 */
#define RGPIO_ISFR_ISF27(x)                       (((uint32_t)(((uint32_t)(x)) << RGPIO_ISFR_ISF27_SHIFT)) & RGPIO_ISFR_ISF27_MASK)

#define RGPIO_ISFR_ISF28_MASK                     (0x10000000U)
#define RGPIO_ISFR_ISF28_SHIFT                    (28U)
/*! ISF28 - Interrupt Status Flag
 *  0b0..Not detected
 *  0b1..Detected
 *  0b0..No effect
 *  0b1..Clear the flag
 */
#define RGPIO_ISFR_ISF28(x)                       (((uint32_t)(((uint32_t)(x)) << RGPIO_ISFR_ISF28_SHIFT)) & RGPIO_ISFR_ISF28_MASK)

#define RGPIO_ISFR_ISF29_MASK                     (0x20000000U)
#define RGPIO_ISFR_ISF29_SHIFT                    (29U)
/*! ISF29 - Interrupt Status Flag
 *  0b0..Not detected
 *  0b1..Detected
 *  0b0..No effect
 *  0b1..Clear the flag
 */
#define RGPIO_ISFR_ISF29(x)                       (((uint32_t)(((uint32_t)(x)) << RGPIO_ISFR_ISF29_SHIFT)) & RGPIO_ISFR_ISF29_MASK)

#define RGPIO_ISFR_ISF30_MASK                     (0x40000000U)
#define RGPIO_ISFR_ISF30_SHIFT                    (30U)
/*! ISF30 - Interrupt Status Flag
 *  0b0..Not detected
 *  0b1..Detected
 *  0b0..No effect
 *  0b1..Clear the flag
 */
#define RGPIO_ISFR_ISF30(x)                       (((uint32_t)(((uint32_t)(x)) << RGPIO_ISFR_ISF30_SHIFT)) & RGPIO_ISFR_ISF30_MASK)

#define RGPIO_ISFR_ISF31_MASK                     (0x80000000U)
#define RGPIO_ISFR_ISF31_SHIFT                    (31U)
/*! ISF31 - Interrupt Status Flag
 *  0b0..Not detected
 *  0b1..Detected
 *  0b0..No effect
 *  0b1..Clear the flag
 */
#define RGPIO_ISFR_ISF31(x)                       (((uint32_t)(((uint32_t)(x)) << RGPIO_ISFR_ISF31_SHIFT)) & RGPIO_ISFR_ISF31_MASK)
/*! @} */

/* The count of RGPIO_ISFR */
#define RGPIO_ISFR_COUNT                          (2U)


/*!
 * @}
 */ /* end of group RGPIO_Register_Masks */


/* RGPIO - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral RGPIO8 base address */
  #define RGPIO8_BASE                               (0x50320000u)
  /** Peripheral RGPIO8 base address */
  #define RGPIO8_BASE_NS                            (0x40320000u)
  /** Peripheral RGPIO8 base pointer */
  #define RGPIO8                                    ((RGPIO_Type *)RGPIO8_BASE)
  /** Peripheral RGPIO8 base pointer */
  #define RGPIO8_NS                                 ((RGPIO_Type *)RGPIO8_BASE_NS)
  /** Peripheral RGPIO9 base address */
  #define RGPIO9_BASE                               (0x50322000u)
  /** Peripheral RGPIO9 base address */
  #define RGPIO9_BASE_NS                            (0x40322000u)
  /** Peripheral RGPIO9 base pointer */
  #define RGPIO9                                    ((RGPIO_Type *)RGPIO9_BASE)
  /** Peripheral RGPIO9 base pointer */
  #define RGPIO9_NS                                 ((RGPIO_Type *)RGPIO9_BASE_NS)
  /** Peripheral RGPIO10 base address */
  #define RGPIO10_BASE                              (0x50324000u)
  /** Peripheral RGPIO10 base address */
  #define RGPIO10_BASE_NS                           (0x40324000u)
  /** Peripheral RGPIO10 base pointer */
  #define RGPIO10                                   ((RGPIO_Type *)RGPIO10_BASE)
  /** Peripheral RGPIO10 base pointer */
  #define RGPIO10_NS                                ((RGPIO_Type *)RGPIO10_BASE_NS)
  /** Peripheral RGPIO8_ALIAS base address */
  #define RGPIO8_ALIAS_BASE                         (0x50321000u)
  /** Peripheral RGPIO8_ALIAS base address */
  #define RGPIO8_ALIAS_BASE_NS                      (0x40321000u)
  /** Peripheral RGPIO8_ALIAS base pointer */
  #define RGPIO8_ALIAS                              ((RGPIO_Type *)RGPIO8_ALIAS_BASE)
  /** Peripheral RGPIO8_ALIAS base pointer */
  #define RGPIO8_ALIAS_NS                           ((RGPIO_Type *)RGPIO8_ALIAS_BASE_NS)
  /** Peripheral RGPIO9_ALIAS base address */
  #define RGPIO9_ALIAS_BASE                         (0x50323000u)
  /** Peripheral RGPIO9_ALIAS base address */
  #define RGPIO9_ALIAS_BASE_NS                      (0x40323000u)
  /** Peripheral RGPIO9_ALIAS base pointer */
  #define RGPIO9_ALIAS                              ((RGPIO_Type *)RGPIO9_ALIAS_BASE)
  /** Peripheral RGPIO9_ALIAS base pointer */
  #define RGPIO9_ALIAS_NS                           ((RGPIO_Type *)RGPIO9_ALIAS_BASE_NS)
  /** Peripheral RGPIO10_ALIAS base address */
  #define RGPIO10_ALIAS_BASE                        (0x50325000u)
  /** Peripheral RGPIO10_ALIAS base address */
  #define RGPIO10_ALIAS_BASE_NS                     (0x40325000u)
  /** Peripheral RGPIO10_ALIAS base pointer */
  #define RGPIO10_ALIAS                             ((RGPIO_Type *)RGPIO10_ALIAS_BASE)
  /** Peripheral RGPIO10_ALIAS base pointer */
  #define RGPIO10_ALIAS_NS                          ((RGPIO_Type *)RGPIO10_ALIAS_BASE_NS)
  /** Array initializer of RGPIO peripheral base addresses */
  #define RGPIO_BASE_ADDRS                          { 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, RGPIO8_BASE, RGPIO9_BASE, RGPIO10_BASE, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, RGPIO8_ALIAS_BASE, RGPIO9_ALIAS_BASE, RGPIO10_ALIAS_BASE }
  /** Array initializer of RGPIO peripheral base pointers */
  #define RGPIO_BASE_PTRS                           { (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, RGPIO8, RGPIO9, RGPIO10, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, RGPIO8_ALIAS, RGPIO9_ALIAS, RGPIO10_ALIAS }
  /** Array initializer of RGPIO peripheral base addresses */
  #define RGPIO_BASE_ADDRS_NS                       { 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, RGPIO8_BASE_NS, RGPIO9_BASE_NS, RGPIO10_BASE_NS, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, RGPIO8_ALIAS_BASE_NS, RGPIO9_ALIAS_BASE_NS, RGPIO10_ALIAS_BASE_NS }
  /** Array initializer of RGPIO peripheral base pointers */
  #define RGPIO_BASE_PTRS_NS                        { (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, RGPIO8_NS, RGPIO9_NS, RGPIO10_NS, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, RGPIO8_ALIAS_NS, RGPIO9_ALIAS_NS, RGPIO10_ALIAS_NS }
#else
  /** Peripheral RGPIO8 base address */
  #define RGPIO8_BASE                               (0x40320000u)
  /** Peripheral RGPIO8 base pointer */
  #define RGPIO8                                    ((RGPIO_Type *)RGPIO8_BASE)
  /** Peripheral RGPIO9 base address */
  #define RGPIO9_BASE                               (0x40322000u)
  /** Peripheral RGPIO9 base pointer */
  #define RGPIO9                                    ((RGPIO_Type *)RGPIO9_BASE)
  /** Peripheral RGPIO10 base address */
  #define RGPIO10_BASE                              (0x40324000u)
  /** Peripheral RGPIO10 base pointer */
  #define RGPIO10                                   ((RGPIO_Type *)RGPIO10_BASE)
  /** Peripheral RGPIO8_ALIAS base address */
  #define RGPIO8_ALIAS_BASE                         (0x40321000u)
  /** Peripheral RGPIO8_ALIAS base pointer */
  #define RGPIO8_ALIAS                              ((RGPIO_Type *)RGPIO8_ALIAS_BASE)
  /** Peripheral RGPIO9_ALIAS base address */
  #define RGPIO9_ALIAS_BASE                         (0x40323000u)
  /** Peripheral RGPIO9_ALIAS base pointer */
  #define RGPIO9_ALIAS                              ((RGPIO_Type *)RGPIO9_ALIAS_BASE)
  /** Peripheral RGPIO10_ALIAS base address */
  #define RGPIO10_ALIAS_BASE                        (0x40325000u)
  /** Peripheral RGPIO10_ALIAS base pointer */
  #define RGPIO10_ALIAS                             ((RGPIO_Type *)RGPIO10_ALIAS_BASE)
  /** Array initializer of RGPIO peripheral base addresses */
  #define RGPIO_BASE_ADDRS                          { 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, RGPIO8_BASE, RGPIO9_BASE, RGPIO10_BASE, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, RGPIO8_ALIAS_BASE, RGPIO9_ALIAS_BASE, RGPIO10_ALIAS_BASE }
  /** Array initializer of RGPIO peripheral base pointers */
  #define RGPIO_BASE_PTRS                           { (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, RGPIO8, RGPIO9, RGPIO10, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, (RGPIO_Type *)0u, RGPIO8_ALIAS, RGPIO9_ALIAS, RGPIO10_ALIAS }
#endif
/* Interrupt vectors for the RGPIO peripheral type */
#define RGPIO_IRQS   {RGPIO80_IRQn, RGPIO90_IRQn, RGPIO100_IRQn}
#define RGPIO_IRQS_1 {RGPIO81_IRQn, RGPIO91_IRQn, RGPIO101_IRQn}


/*!
 * @}
 */ /* end of group GPIO_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- I2S Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup I2S_Peripheral_Access_Layer I2S Peripheral Access Layer
 * @{
 */

