nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_cm33_core1.h
#define PINT_PMCFG_CFG4_MASK                     (0x700000U)
#define PINT_PMCFG_CFG4_SHIFT                    (20U)
/*! CFG4 - Match Configuration
 *  0b000..Constant HIGH
 *  0b001..Sticky rising edge
 *  0b010..Sticky falling edge
 *  0b011..Sticky rising or falling edge
 *  0b100..High level
 *  0b101..Low level
 *  0b110..Constant 0
 *  0b111..Event (Nonsticky rising or falling edge)
 */
#define PINT_PMCFG_CFG4(x)                       (((uint32_t)(((uint32_t)(x)) << PINT_PMCFG_CFG4_SHIFT)) & PINT_PMCFG_CFG4_MASK)

#define PINT_PMCFG_CFG5_MASK                     (0x3800000U)
#define PINT_PMCFG_CFG5_SHIFT                    (23U)
/*! CFG5 - Match Configuration
 *  0b000..Constant HIGH
 *  0b001..Sticky rising edge
 *  0b010..Sticky falling edge
 *  0b011..Sticky rising or falling edge
 *  0b100..High level
 *  0b101..Low level
 *  0b110..Constant 0
 *  0b111..Event (Nonsticky rising or falling edge)
 */
#define PINT_PMCFG_CFG5(x)                       (((uint32_t)(((uint32_t)(x)) << PINT_PMCFG_CFG5_SHIFT)) & PINT_PMCFG_CFG5_MASK)

#define PINT_PMCFG_CFG6_MASK                     (0x1C000000U)
#define PINT_PMCFG_CFG6_SHIFT                    (26U)
/*! CFG6 - Match Configuration
 *  0b000..Constant HIGH
 *  0b001..Sticky rising edge
 *  0b010..Sticky falling edge
 *  0b011..Sticky rising or falling edge
 *  0b100..High level
 *  0b101..Low level
 *  0b110..Constant 0
 *  0b111..Event (Nonsticky rising or falling edge)
 */
#define PINT_PMCFG_CFG6(x)                       (((uint32_t)(((uint32_t)(x)) << PINT_PMCFG_CFG6_SHIFT)) & PINT_PMCFG_CFG6_MASK)

#define PINT_PMCFG_CFG7_MASK                     (0xE0000000U)
#define PINT_PMCFG_CFG7_SHIFT                    (29U)
/*! CFG7 - Match Configuration
 *  0b000..Constant HIGH
 *  0b001..Sticky rising edge
 *  0b010..Sticky falling edge
 *  0b011..Sticky rising or falling edge
 *  0b100..High level
 *  0b101..Low level
 *  0b110..Constant 0
 *  0b111..Event (Nonsticky rising or falling edge)
 */
#define PINT_PMCFG_CFG7(x)                       (((uint32_t)(((uint32_t)(x)) << PINT_PMCFG_CFG7_SHIFT)) & PINT_PMCFG_CFG7_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group PINT_Register_Masks */


/* PINT - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral PINT1 base address */
  #define PINT1_BASE                               (0x50045000u)
  /** Peripheral PINT1 base address */
  #define PINT1_BASE_NS                            (0x40045000u)
  /** Peripheral PINT1 base pointer */
  #define PINT1                                    ((PINT_Type *)PINT1_BASE)
  /** Peripheral PINT1 base pointer */
  #define PINT1_NS                                 ((PINT_Type *)PINT1_BASE_NS)
  /** Array initializer of PINT peripheral base addresses */
  #define PINT_BASE_ADDRS                          { PINT1_BASE }
  /** Array initializer of PINT peripheral base pointers */
  #define PINT_BASE_PTRS                           { PINT1 }
  /** Array initializer of PINT peripheral base addresses */
  #define PINT_BASE_ADDRS_NS                       { PINT1_BASE_NS }
  /** Array initializer of PINT peripheral base pointers */
  #define PINT_BASE_PTRS_NS                        { PINT1_NS }
#else
  /** Peripheral PINT1 base address */
  #define PINT1_BASE                               (0x40045000u)
  /** Peripheral PINT1 base pointer */
  #define PINT1                                    ((PINT_Type *)PINT1_BASE)
  /** Array initializer of PINT peripheral base addresses */
  #define PINT_BASE_ADDRS                          { PINT1_BASE }
  /** Array initializer of PINT peripheral base pointers */
  #define PINT_BASE_PTRS                           { PINT1 }
#endif
/** Interrupt vectors for the PINT peripheral type */
#define PINT_IRQS                                { PIN_INT0_IRQn, PIN_INT1_IRQn, PIN_INT2_IRQn, PIN_INT3_IRQn }

/*!
 * @}
 */ /* end of group PINT_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- PMC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PMC_Peripheral_Access_Layer PMC Peripheral Access Layer
 * @{
 */

/** PMC - Register Layout Typedef */
typedef struct {
  __I  uint32_t VERID;                             /**< PMC Version and Feature ID, offset: 0x0 */
  __I  uint32_t STATUS;                            /**< PMC Status, offset: 0x4 */
  __IO uint32_t FLAGS;                             /**< PMC Flags in Sense Domain, offset: 0x8 */
  __IO uint32_t CTRL;                              /**< Control, offset: 0xC */
  __IO uint32_t INTRCTRL;                          /**< Interrupt Control in Sense Domain, offset: 0x10 */
       uint8_t RESERVED_0[12];
  __I  uint32_t DCDCVSEL;                          /**< DCDC Voltage Selection, offset: 0x20 */
  __I  uint32_t LDOVDD2VSEL;                       /**< LDO VDD2 Voltage Selection, offset: 0x24 */
  __IO uint32_t LDOVDD1VSEL;                       /**< LDO VDD1 Voltage Selection, offset: 0x28 */
  __I  uint32_t LVDVDDNCTRL;                       /**< VDDN LVD Control, offset: 0x2C */
  __I  uint32_t LVDVDD2CTRL;                       /**< VDD2 LVD Control, offset: 0x30 */
  __IO uint32_t LVDVDD1CTRL;                       /**< VDD1 LVD Control, offset: 0x34 */
  __I  uint32_t PORCTRL;                           /**< Power-on Reset Control, offset: 0x38 */
       uint8_t RESERVED_1[4];
  __I  uint32_t BBCTRL;                            /**< Body Bias Control, offset: 0x40 */
  __IO uint32_t TSENSOR;                           /**< Temperature Sensor Control, offset: 0x44 */
       uint8_t RESERVED_2[8];
  __IO uint32_t WAKEUP;                            /**< Wake-up Configuration for Sense Domain, offset: 0x50 */
       uint8_t RESERVED_3[16];
  __I  uint32_t POWERCFG;                          /**< Power Configuration, offset: 0x64 */
  __I  uint32_t PADVRANGE;                         /**< 3 V Capable VDDIO Range Select, offset: 0x68 */
  __IO uint32_t PADCFG;                            /**< IO Bank State Configuration, offset: 0x6C */
       uint8_t RESERVED_4[48];
  __IO uint32_t PDRUNCFG0;                         /**< PD Run Configuration 0 in Sense Domain, offset: 0xA0 */
  __IO uint32_t PDRUNCFG1;                         /**< PD Run Configuration 1 in Sense Domain, offset: 0xA4 */
  __IO uint32_t PDRUNCFG2;                         /**< PD Run Configuration 2 in Sense Domain, offset: 0xA8 */
  __IO uint32_t PDRUNCFG3;                         /**< PD Run Configuration 3 in Sense Domain, offset: 0xAC */
  __IO uint32_t PDRUNCFG4;                         /**< PD Run Configuration 4 in Sense Domain, offset: 0xB0 */
  __IO uint32_t PDRUNCFG5;                         /**< PD Run Configuration 5 in Sense Domain, offset: 0xB4 */
  __IO uint32_t PDSLEEPCFG0;                       /**< PD Sleep Configuration 0 in Sense Domain, offset: 0xB8 */
  __IO uint32_t PDSLEEPCFG1;                       /**< PD Sleep Configuration 1 in Sense Domain, offset: 0xBC */
  __IO uint32_t PDSLEEPCFG2;                       /**< PD Sleep Configuration 2 in Sense Domain, offset: 0xC0 */
  __IO uint32_t PDSLEEPCFG3;                       /**< PD Sleep Configuration 3 in Sense Domain, offset: 0xC4 */
  __IO uint32_t PDSLEEPCFG4;                       /**< PD Sleep Configuration 4 in Sense Domain, offset: 0xC8 */
  __IO uint32_t PDSLEEPCFG5;                       /**< PD Sleep Configuration 5 in Sense Domain, offset: 0xCC */
  __I  uint32_t PDCFGSTATUS0;                      /**< PD Configuration Status 0, offset: 0xD0 */
  __I  uint32_t PDCFGSTATUS1;                      /**< PD Configuration Status 1, offset: 0xD4 */
  __I  uint32_t PDCFGSTATUS2;                      /**< PD Configuration Status 2, offset: 0xD8 */
  __I  uint32_t PDCFGSTATUS3;                      /**< PD Configuration Status 3, offset: 0xDC */
  __I  uint32_t PDCFGSTATUS4;                      /**< PD Configuration Status 4, offset: 0xE0 */
  __I  uint32_t PDCFGSTATUS5;                      /**< PD Configuration Status 5, offset: 0xE4 */
  __IO uint32_t PDWAKECFG;                         /**< PD Wake-up Configuration for Sense Domain, offset: 0xE8 */
  __IO uint32_t PWRFLAGS;                          /**< Power Domain Flags for Sense Domain, offset: 0xEC */
} PMC_Type;

/* ----------------------------------------------------------------------------
   -- PMC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PMC_Register_Masks PMC Register Masks
 * @{
 */

