nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_cm33_core1.h
#define PMC_FLAGS_PORVDD1F_MASK                  (0x800U)
#define PMC_FLAGS_PORVDD1F_SHIFT                 (11U)
/*! PORVDD1F - VDD1 Power-on Reset Flag
 *  0b0..POR status cleared
 *  0b1..POR status asserted
 */
#define PMC_FLAGS_PORVDD1F(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_PORVDD1F_SHIFT)) & PMC_FLAGS_PORVDD1F_MASK)

#define PMC_FLAGS_PORVDD2F_MASK                  (0x1000U)
#define PMC_FLAGS_PORVDD2F_SHIFT                 (12U)
/*! PORVDD2F - VDD2 Power-on Reset Flag
 *  0b0..POR status cleared
 *  0b1..POR status asserted
 */
#define PMC_FLAGS_PORVDD2F(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_PORVDD2F_SHIFT)) & PMC_FLAGS_PORVDD2F_MASK)

#define PMC_FLAGS_PORVDDNF_MASK                  (0x2000U)
#define PMC_FLAGS_PORVDDNF_SHIFT                 (13U)
/*! PORVDDNF - VDDN Power-on Reset Flag
 *  0b0..POR status cleared
 *  0b1..POR status asserted
 */
#define PMC_FLAGS_PORVDDNF(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_PORVDDNF_SHIFT)) & PMC_FLAGS_PORVDDNF_MASK)

#define PMC_FLAGS_POR1V8F_MASK                   (0x4000U)
#define PMC_FLAGS_POR1V8F_SHIFT                  (14U)
/*! POR1V8F - VDD1V8 Power-on Reset Flag
 *  0b0..POR status cleared
 *  0b1..POR status asserted
 */
#define PMC_FLAGS_POR1V8F(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_POR1V8F_SHIFT)) & PMC_FLAGS_POR1V8F_MASK)

#define PMC_FLAGS_PORAO18F_MASK                  (0x8000U)
#define PMC_FLAGS_PORAO18F_SHIFT                 (15U)
/*! PORAO18F - VDD1V8_AO Power-on Reset Flag
 *  0b0..POR status cleared
 *  0b1..POR status asserted
 */
#define PMC_FLAGS_PORAO18F(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_PORAO18F_SHIFT)) & PMC_FLAGS_PORAO18F_MASK)

#define PMC_FLAGS_AGDET1F_MASK                   (0x10000U)
#define PMC_FLAGS_AGDET1F_SHIFT                  (16U)
/*! AGDET1F - VDD1 Glitch Detector Flag
 *  0b0..Glitch detector status cleared
 *  0b1..Glitch detector status asserted
 */
#define PMC_FLAGS_AGDET1F(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_AGDET1F_SHIFT)) & PMC_FLAGS_AGDET1F_MASK)

#define PMC_FLAGS_AGDET2F_MASK                   (0x20000U)
#define PMC_FLAGS_AGDET2F_SHIFT                  (17U)
/*! AGDET2F - VDD2 Glitch Detector Flag
 *  0b0..Glitch detector status cleared
 *  0b1..Glitch detector status asserted
 */
#define PMC_FLAGS_AGDET2F(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_AGDET2F_SHIFT)) & PMC_FLAGS_AGDET2F_MASK)

#define PMC_FLAGS_LVDVDD1F_MASK                  (0x40000U)
#define PMC_FLAGS_LVDVDD1F_SHIFT                 (18U)
/*! LVDVDD1F - VDD1 Low-Voltage Detector Flag
 *  0b0..Low-voltage detector status cleared
 *  0b1..Low-voltage detector status asserted
 */
#define PMC_FLAGS_LVDVDD1F(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_LVDVDD1F_SHIFT)) & PMC_FLAGS_LVDVDD1F_MASK)

#define PMC_FLAGS_LVDVDD2F_MASK                  (0x80000U)
#define PMC_FLAGS_LVDVDD2F_SHIFT                 (19U)
/*! LVDVDD2F - VDD2 Low-Voltage Detector Flag
 *  0b0..Low-voltage detector status cleared
 *  0b1..Low-voltage detector status asserted
 */
#define PMC_FLAGS_LVDVDD2F(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_LVDVDD2F_SHIFT)) & PMC_FLAGS_LVDVDD2F_MASK)

#define PMC_FLAGS_LVDVDDNF_MASK                  (0x100000U)
#define PMC_FLAGS_LVDVDDNF_SHIFT                 (20U)
/*! LVDVDDNF - VDDN Low-Voltage Detector Flag
 *  0b0..Low-voltage detector status cleared
 *  0b1..Low-voltage detector status asserted
 */
#define PMC_FLAGS_LVDVDDNF(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_LVDVDDNF_SHIFT)) & PMC_FLAGS_LVDVDDNF_MASK)

#define PMC_FLAGS_HVDVDD1F_MASK                  (0x200000U)
#define PMC_FLAGS_HVDVDD1F_SHIFT                 (21U)
/*! HVDVDD1F - VDD1 High-Voltage Detector Flag
 *  0b0..High-voltage detector status cleared
 *  0b1..High-voltage detector status asserted
 */
#define PMC_FLAGS_HVDVDD1F(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_HVDVDD1F_SHIFT)) & PMC_FLAGS_HVDVDD1F_MASK)

#define PMC_FLAGS_HVDVDD2F_MASK                  (0x400000U)
#define PMC_FLAGS_HVDVDD2F_SHIFT                 (22U)
/*! HVDVDD2F - VDD2 High-Voltage Detector Flag
 *  0b0..High-voltage detector status cleared
 *  0b1..High-voltage detector status asserted
 */
#define PMC_FLAGS_HVDVDD2F(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_HVDVDD2F_SHIFT)) & PMC_FLAGS_HVDVDD2F_MASK)

#define PMC_FLAGS_HVDVDDNF_MASK                  (0x800000U)
#define PMC_FLAGS_HVDVDDNF_SHIFT                 (23U)
/*! HVDVDDNF - VDDN High-Voltage Detector Flag
 *  0b0..High-voltage detector status cleared
 *  0b1..High-voltage detector status asserted
 */
#define PMC_FLAGS_HVDVDDNF(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_HVDVDDNF_SHIFT)) & PMC_FLAGS_HVDVDDNF_MASK)

#define PMC_FLAGS_HVD1V8F_MASK                   (0x1000000U)
#define PMC_FLAGS_HVD1V8F_SHIFT                  (24U)
/*! HVD1V8F - VDD1V8 High-Voltage Detector Flag
 *  0b0..High-voltage detector status cleared
 *  0b1..High-voltage detector status asserted
 */
#define PMC_FLAGS_HVD1V8F(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_HVD1V8F_SHIFT)) & PMC_FLAGS_HVD1V8F_MASK)

#define PMC_FLAGS_RTCF_MASK                      (0x2000000U)
#define PMC_FLAGS_RTCF_SHIFT                     (25U)
/*! RTCF - RTC Flag
 *  0b0..RTC status cleared
 *  0b1..RTC status asserted
 */
#define PMC_FLAGS_RTCF(x)                        (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_RTCF_SHIFT)) & PMC_FLAGS_RTCF_MASK)

#define PMC_FLAGS_AUTOWKF_MASK                   (0x4000000U)
#define PMC_FLAGS_AUTOWKF_SHIFT                  (26U)
/*! AUTOWKF - Auto Wake-up Flag
 *  0b0..Auto wake-up status cleared
 *  0b1..Auto wake-up status asserted
 */
#define PMC_FLAGS_AUTOWKF(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_AUTOWKF_SHIFT)) & PMC_FLAGS_AUTOWKF_MASK)

#define PMC_FLAGS_INTNF_MASK                     (0x8000000U)
#define PMC_FLAGS_INTNF_SHIFT                    (27U)
/*! INTNF - PMIC_IRQN Interrupt Pin Flag
 *  0b0..Interrupt pin status cleared
 *  0b1..Interrupt pin status asserted
 */
#define PMC_FLAGS_INTNF(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_INTNF_SHIFT)) & PMC_FLAGS_INTNF_MASK)

#define PMC_FLAGS_RESETNF_MASK                   (0x10000000U)
#define PMC_FLAGS_RESETNF_SHIFT                  (28U)
/*! RESETNF - Reset Pin Flag
 *  0b0..Reset pin status cleared
 *  0b1..Reset pin status asserted
 */
#define PMC_FLAGS_RESETNF(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_RESETNF_SHIFT)) & PMC_FLAGS_RESETNF_MASK)

#define PMC_FLAGS_DSSENSF_MASK                   (0x20000000U)
#define PMC_FLAGS_DSSENSF_SHIFT                  (29U)
/*! DSSENSF - CPU1 Deep Sleep Mode Flag
 *  0b0..CPU1 Deep Sleep cleared
 *  0b1..CPU1 Deep Sleep asserted
 */
#define PMC_FLAGS_DSSENSF(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_DSSENSF_SHIFT)) & PMC_FLAGS_DSSENSF_MASK)

