nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_cm33_core1.h
#define PMC_LDOVDD2VSEL_VSEL2_MASK               (0x3F0000U)
#define PMC_LDOVDD2VSEL_VSEL2_SHIFT              (16U)
/*! VSEL2 - LDO VDD2 Voltage Level 2
 *  0b000000..0.45 V
 *  0b010000..0.65 V
 *  0b100000..0.85 V
 *  0b110000..1.05 V
 *  0b111000..1.15 V (maximum)
 *  0b111111..1.15 V (clipped)
 */
#define PMC_LDOVDD2VSEL_VSEL2(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_LDOVDD2VSEL_VSEL2_SHIFT)) & PMC_LDOVDD2VSEL_VSEL2_MASK)

#define PMC_LDOVDD2VSEL_VSEL3_MASK               (0x3F000000U)
#define PMC_LDOVDD2VSEL_VSEL3_SHIFT              (24U)
/*! VSEL3 - LDO VDD2 Voltage Level 3
 *  0b000000..0.45 V
 *  0b010000..0.65 V
 *  0b100000..0.85 V
 *  0b110000..1.05 V
 *  0b111000..1.15 V (maximum)
 *  0b111111..1.15 V (clipped)
 */
#define PMC_LDOVDD2VSEL_VSEL3(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_LDOVDD2VSEL_VSEL3_SHIFT)) & PMC_LDOVDD2VSEL_VSEL3_MASK)
/*! @} */

/*! @name LDOVDD1VSEL - LDO VDD1 Voltage Selection */
/*! @{ */

#define PMC_LDOVDD1VSEL_VSEL0_MASK               (0x3FU)
#define PMC_LDOVDD1VSEL_VSEL0_SHIFT              (0U)
/*! VSEL0 - LDO VDD1 Voltage Level 0
 *  0b000000..0.45 V
 *  0b010000..0.65 V
 *  0b100000..0.85 V
 *  0b110000..1.05 V
 *  0b111000..1.15 V (maximum)
 *  0b111111..1.15 V (clipped)
 */
#define PMC_LDOVDD1VSEL_VSEL0(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_LDOVDD1VSEL_VSEL0_SHIFT)) & PMC_LDOVDD1VSEL_VSEL0_MASK)

#define PMC_LDOVDD1VSEL_VSEL1_MASK               (0x3F00U)
#define PMC_LDOVDD1VSEL_VSEL1_SHIFT              (8U)
/*! VSEL1 - LDO VDD1 Voltage Level 1
 *  0b000000..0.45 V
 *  0b010000..0.65 V
 *  0b100000..0.85 V
 *  0b110000..1.05 V
 *  0b111000..1.15 V (maximum)
 *  0b111111..1.15 V (clipped)
 */
#define PMC_LDOVDD1VSEL_VSEL1(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_LDOVDD1VSEL_VSEL1_SHIFT)) & PMC_LDOVDD1VSEL_VSEL1_MASK)

#define PMC_LDOVDD1VSEL_VSEL2_MASK               (0x3F0000U)
#define PMC_LDOVDD1VSEL_VSEL2_SHIFT              (16U)
/*! VSEL2 - LDO VDD1 Voltage Level 2
 *  0b000000..0.45 V
 *  0b010000..0.65 V
 *  0b100000..0.85 V
 *  0b110000..1.05 V
 *  0b111000..1.15 V (maximum)
 *  0b111111..1.15 V (clipped)
 */
#define PMC_LDOVDD1VSEL_VSEL2(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_LDOVDD1VSEL_VSEL2_SHIFT)) & PMC_LDOVDD1VSEL_VSEL2_MASK)

#define PMC_LDOVDD1VSEL_VSEL3_MASK               (0x3F000000U)
#define PMC_LDOVDD1VSEL_VSEL3_SHIFT              (24U)
/*! VSEL3 - LDO VDD1 Voltage Level 3
 *  0b000000..0.45 V
 *  0b010000..0.65 V
 *  0b100000..0.85 V
 *  0b110000..1.05 V
 *  0b111000..1.15 V (maximum)
 *  0b111111..1.15 V (clipped)
 */
#define PMC_LDOVDD1VSEL_VSEL3(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_LDOVDD1VSEL_VSEL3_SHIFT)) & PMC_LDOVDD1VSEL_VSEL3_MASK)
/*! @} */

/*! @name LVDVDDNCTRL - VDDN LVD Control */
/*! @{ */

#define PMC_LVDVDDNCTRL_LVL0_MASK                (0x3FU)
#define PMC_LVDVDDNCTRL_LVL0_SHIFT               (0U)
/*! LVL0 - LVD Level 0 Voltage
 *  0b000000..0.50 V
 *  0b010000..0.66 V
 *  0b100000..0.82 V
 *  0b110000..0.98 V
 *  0b111111..1.13 V
 */
#define PMC_LVDVDDNCTRL_LVL0(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_LVDVDDNCTRL_LVL0_SHIFT)) & PMC_LVDVDDNCTRL_LVL0_MASK)

#define PMC_LVDVDDNCTRL_LVL1_MASK                (0x3F00U)
#define PMC_LVDVDDNCTRL_LVL1_SHIFT               (8U)
/*! LVL1 - LVD Level 1 Voltage
 *  0b000000..0.50 V
 *  0b010000..0.66 V
 *  0b100000..0.82 V
 *  0b110000..0.98 V
 *  0b111111..1.13 V
 */
#define PMC_LVDVDDNCTRL_LVL1(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_LVDVDDNCTRL_LVL1_SHIFT)) & PMC_LVDVDDNCTRL_LVL1_MASK)
/*! @} */

/*! @name LVDVDD2CTRL - VDD2 LVD Control */
/*! @{ */

#define PMC_LVDVDD2CTRL_LVL0_MASK                (0x3FU)
#define PMC_LVDVDD2CTRL_LVL0_SHIFT               (0U)
/*! LVL0 - LVD Level 0 Voltage
 *  0b000000..0.50 V
 *  0b010000..0.66 V
 *  0b100000..0.82 V
 *  0b110000..0.98 V
 *  0b111111..1.13 V
 */
#define PMC_LVDVDD2CTRL_LVL0(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_LVDVDD2CTRL_LVL0_SHIFT)) & PMC_LVDVDD2CTRL_LVL0_MASK)

#define PMC_LVDVDD2CTRL_LVL1_MASK                (0x3F00U)
#define PMC_LVDVDD2CTRL_LVL1_SHIFT               (8U)
/*! LVL1 - LVD Level 1 Voltage
 *  0b000000..0.50 V
 *  0b010000..0.66 V
 *  0b100000..0.82 V
 *  0b110000..0.98 V
 *  0b111111..1.13 V
 */
#define PMC_LVDVDD2CTRL_LVL1(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_LVDVDD2CTRL_LVL1_SHIFT)) & PMC_LVDVDD2CTRL_LVL1_MASK)

#define PMC_LVDVDD2CTRL_LVL2_MASK                (0x3F0000U)
#define PMC_LVDVDD2CTRL_LVL2_SHIFT               (16U)
/*! LVL2 - LVD Level 2 Voltage
 *  0b000000..0.50 V
 *  0b010000..0.66 V
 *  0b100000..0.82 V
 *  0b110000..0.98 V
 *  0b111111..1.13 V
 */
#define PMC_LVDVDD2CTRL_LVL2(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_LVDVDD2CTRL_LVL2_SHIFT)) & PMC_LVDVDD2CTRL_LVL2_MASK)

#define PMC_LVDVDD2CTRL_LVL3_MASK                (0x3F000000U)
#define PMC_LVDVDD2CTRL_LVL3_SHIFT               (24U)
/*! LVL3 - LVD Level 3 Voltage
 *  0b000000..0.50 V
 *  0b010000..0.66 V
 *  0b100000..0.82 V
 *  0b110000..0.98 V
 *  0b111111..1.13 V
 */
#define PMC_LVDVDD2CTRL_LVL3(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_LVDVDD2CTRL_LVL3_SHIFT)) & PMC_LVDVDD2CTRL_LVL3_MASK)
/*! @} */

/*! @name LVDVDD1CTRL - VDD1 LVD Control */
/*! @{ */

#define PMC_LVDVDD1CTRL_LVL0_MASK                (0x3FU)
#define PMC_LVDVDD1CTRL_LVL0_SHIFT               (0U)
/*! LVL0 - Level 0 Voltage
 *  0b000000..0.50 V
 *  0b010000..0.66 V
 *  0b100000..0.82 V
 *  0b110000..0.98 V
 *  0b111111..1.13 V
 */
#define PMC_LVDVDD1CTRL_LVL0(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_LVDVDD1CTRL_LVL0_SHIFT)) & PMC_LVDVDD1CTRL_LVL0_MASK)

#define PMC_LVDVDD1CTRL_LVL1_MASK                (0x3F00U)
#define PMC_LVDVDD1CTRL_LVL1_SHIFT               (8U)
/*! LVL1 - Level 1 Voltage */
#define PMC_LVDVDD1CTRL_LVL1(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_LVDVDD1CTRL_LVL1_SHIFT)) & PMC_LVDVDD1CTRL_LVL1_MASK)

#define PMC_LVDVDD1CTRL_LVL2_MASK                (0x3F0000U)
#define PMC_LVDVDD1CTRL_LVL2_SHIFT               (16U)
/*! LVL2 - Level 2 Voltage
 *  0b000000..0.50 V
 *  0b010000..0.66 V
 *  0b100000..0.82 V
 *  0b110000..0.98 V
 *  0b111111..1.13 V
 */
#define PMC_LVDVDD1CTRL_LVL2(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_LVDVDD1CTRL_LVL2_SHIFT)) & PMC_LVDVDD1CTRL_LVL2_MASK)

#define PMC_LVDVDD1CTRL_LVL3_MASK                (0x3F000000U)
#define PMC_LVDVDD1CTRL_LVL3_SHIFT               (24U)
/*! LVL3 - Level 3 Voltage
 *  0b000000..0.50 V
 *  0b010000..0.66 V
 *  0b100000..0.82 V
 *  0b110000..0.98 V
 *  0b111111..1.13 V
 */
#define PMC_LVDVDD1CTRL_LVL3(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_LVDVDD1CTRL_LVL3_SHIFT)) & PMC_LVDVDD1CTRL_LVL3_MASK)
/*! @} */

/*! @name PORCTRL - Power-on Reset Control */
/*! @{ */

#define PMC_PORCTRL_VDD1LVL_MASK                 (0x1FU)
#define PMC_PORCTRL_VDD1LVL_SHIFT                (0U)
/*! VDD1LVL - POR Level in VDD1 Domain
 *  0b00000..0.40 V
 *  0b01000..0.48 V
 *  0b10000..0.56 V
 *  0b11000..0.64 V
 *  0b11111..0.72 V
 */
#define PMC_PORCTRL_VDD1LVL(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PORCTRL_VDD1LVL_SHIFT)) & PMC_PORCTRL_VDD1LVL_MASK)

#define PMC_PORCTRL_VDD2LVL_MASK                 (0x1F00U)
#define PMC_PORCTRL_VDD2LVL_SHIFT                (8U)
/*! VDD2LVL - POR Level in VDD2 Domain
 *  0b00000..0.40 V
 *  0b01000..0.48 V
 *  0b10000..0.56 V
 *  0b11000..0.64 V
 *  0b11111..0.72 V
 */
#define PMC_PORCTRL_VDD2LVL(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PORCTRL_VDD2LVL_SHIFT)) & PMC_PORCTRL_VDD2LVL_MASK)

