nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_cm33_core1.h
#define PMC_PDSLEEPCFG5_DSP_ITCM_MASK            (0x4000U)
#define PMC_PDSLEEPCFG5_DSP_ITCM_SHIFT           (14U)
/*! DSP_ITCM - HiFi4 Instruction TCM
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG5_DSP_ITCM(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG5_DSP_ITCM_SHIFT)) & PMC_PDSLEEPCFG5_DSP_ITCM_MASK)

#define PMC_PDSLEEPCFG5_DSP_DTCM_MASK            (0x8000U)
#define PMC_PDSLEEPCFG5_DSP_DTCM_SHIFT           (15U)
/*! DSP_DTCM - HiFi4 Data TCM
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG5_DSP_DTCM(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG5_DSP_DTCM_SHIFT)) & PMC_PDSLEEPCFG5_DSP_DTCM_MASK)

#define PMC_PDSLEEPCFG5_EZH_TCM_MASK             (0x10000U)
#define PMC_PDSLEEPCFG5_EZH_TCM_SHIFT            (16U)
/*! EZH_TCM - EZH-V TCM
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG5_EZH_TCM(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG5_EZH_TCM_SHIFT)) & PMC_PDSLEEPCFG5_EZH_TCM_MASK)

#define PMC_PDSLEEPCFG5_NPU_MASK                 (0x20000U)
#define PMC_PDSLEEPCFG5_NPU_SHIFT                (17U)
/*! NPU - NPU
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG5_NPU(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG5_NPU_SHIFT)) & PMC_PDSLEEPCFG5_NPU_MASK)

#define PMC_PDSLEEPCFG5_XSPI0_MASK               (0x40000U)
#define PMC_PDSLEEPCFG5_XSPI0_SHIFT              (18U)
/*! XSPI0 - XSPI0, MMU0, and Cache
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG5_XSPI0(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG5_XSPI0_SHIFT)) & PMC_PDSLEEPCFG5_XSPI0_MASK)

#define PMC_PDSLEEPCFG5_XSPI1_MASK               (0x80000U)
#define PMC_PDSLEEPCFG5_XSPI1_SHIFT              (19U)
/*! XSPI1 - XSPI1, MMU1, and Cache
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG5_XSPI1(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG5_XSPI1_SHIFT)) & PMC_PDSLEEPCFG5_XSPI1_MASK)

#define PMC_PDSLEEPCFG5_XSPI2_MASK               (0x100000U)
#define PMC_PDSLEEPCFG5_XSPI2_SHIFT              (20U)
/*! XSPI2 - XSPI2 and MMU2
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG5_XSPI2(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG5_XSPI2_SHIFT)) & PMC_PDSLEEPCFG5_XSPI2_MASK)

#define PMC_PDSLEEPCFG5_LCD_MASK                 (0x200000U)
#define PMC_PDSLEEPCFG5_LCD_SHIFT                (21U)
/*! LCD - LCDIF
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDSLEEPCFG5_LCD(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG5_LCD_SHIFT)) & PMC_PDSLEEPCFG5_LCD_MASK)

#define PMC_PDSLEEPCFG5_OCOTP_MASK               (0x400000U)
#define PMC_PDSLEEPCFG5_OCOTP_SHIFT              (22U)
/*! OCOTP - OCOTP Shadow SRAM
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDSLEEPCFG5_OCOTP(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG5_OCOTP_SHIFT)) & PMC_PDSLEEPCFG5_OCOTP_MASK)
/*! @} */

/*! @name PDCFGSTATUS0 - PD Configuration Status 0 */
/*! @{ */

#define PMC_PDCFGSTATUS0_PMICMODE_MASK           (0x3U)
#define PMC_PDCFGSTATUS0_PMICMODE_SHIFT          (0U)
/*! PMICMODE - PMIC_MODE Output Value
 *  0b00..PMIC_MODE[1:0] pins = 00
 *  0b01..PMIC_MODE[1:0] pins = 01
 *  0b10..PMIC_MODE[1:0] pins = 10
 *  0b11..PMIC_MODE[1:0] pins = 11
 */
#define PMC_PDCFGSTATUS0_PMICMODE(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_PMICMODE_SHIFT)) & PMC_PDCFGSTATUS0_PMICMODE_MASK)

#define PMC_PDCFGSTATUS0_FDSR_MASK               (0x4U)
#define PMC_PDCFGSTATUS0_FDSR_SHIFT              (2U)
/*! FDSR - FDSR Mode
 *  0b1..All core domains are in FDSR mode or power down
 *  0b0..Power switches and DSR status are determined by the single power domain controls
 */
#define PMC_PDCFGSTATUS0_FDSR(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_FDSR_SHIFT)) & PMC_PDCFGSTATUS0_FDSR_MASK)

#define PMC_PDCFGSTATUS0_DPD_MASK                (0x8U)
#define PMC_PDCFGSTATUS0_DPD_SHIFT               (3U)
/*! DPD - DPD Mode
 *  0b1..Activates isolation and correct sequencing for DPD mode
 *  0b0..Enables
 */
#define PMC_PDCFGSTATUS0_DPD(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_DPD_SHIFT)) & PMC_PDCFGSTATUS0_DPD_MASK)

#define PMC_PDCFGSTATUS0_FDPD_MASK               (0x10U)
#define PMC_PDCFGSTATUS0_FDPD_SHIFT              (4U)
/*! FDPD - FDPD Mode
 *  0b1..Activates isolation and correct sequencing for FDPD mode
 *  0b0..Enables
 */
#define PMC_PDCFGSTATUS0_FDPD(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_FDPD_SHIFT)) & PMC_PDCFGSTATUS0_FDPD_MASK)

#define PMC_PDCFGSTATUS0_V2COMP_DSR_MASK         (0x20U)
#define PMC_PDCFGSTATUS0_V2COMP_DSR_SHIFT        (5U)
/*! V2COMP_DSR - DSR of VDD2_COMP Domain
 *  0b1..DSR mode
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS0_V2COMP_DSR(x)           (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_V2COMP_DSR_SHIFT)) & PMC_PDCFGSTATUS0_V2COMP_DSR_MASK)

#define PMC_PDCFGSTATUS0_V2NMED_DSR_MASK         (0x40U)
#define PMC_PDCFGSTATUS0_V2NMED_DSR_SHIFT        (6U)
/*! V2NMED_DSR - DSR of VDD2_MEDIA and VDDN_MEDIA Domains
 *  0b1..DSR mode
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS0_V2NMED_DSR(x)           (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_V2NMED_DSR_SHIFT)) & PMC_PDCFGSTATUS0_V2NMED_DSR_MASK)

#define PMC_PDCFGSTATUS0_V2COM_DSR_MASK          (0x80U)
#define PMC_PDCFGSTATUS0_V2COM_DSR_SHIFT         (7U)
/*! V2COM_DSR - DSR of VDD2_COM Domain
 *  0b1..DSR mode
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS0_V2COM_DSR(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_V2COM_DSR_SHIFT)) & PMC_PDCFGSTATUS0_V2COM_DSR_MASK)

#define PMC_PDCFGSTATUS0_VNCOM_DSR_MASK          (0x100U)
#define PMC_PDCFGSTATUS0_VNCOM_DSR_SHIFT         (8U)
/*! VNCOM_DSR - DSR of VDDN_COM Domain
 *  0b1..DSR mode
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS0_VNCOM_DSR(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_VNCOM_DSR_SHIFT)) & PMC_PDCFGSTATUS0_VNCOM_DSR_MASK)

#define PMC_PDCFGSTATUS0_V2DSP_PD_MASK           (0x200U)
#define PMC_PDCFGSTATUS0_V2DSP_PD_SHIFT          (9U)
/*! V2DSP_PD - HiFi4 Power Down
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS0_V2DSP_PD(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_V2DSP_PD_SHIFT)) & PMC_PDCFGSTATUS0_V2DSP_PD_MASK)

#define PMC_PDCFGSTATUS0_V2MIPI_PD_MASK          (0x400U)
#define PMC_PDCFGSTATUS0_V2MIPI_PD_SHIFT         (10U)
/*! V2MIPI_PD - MIPI PHY Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS0_V2MIPI_PD(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_V2MIPI_PD_SHIFT)) & PMC_PDCFGSTATUS0_V2MIPI_PD_MASK)

#define PMC_PDCFGSTATUS0_DCDC_LP_MASK            (0x1000U)
#define PMC_PDCFGSTATUS0_DCDC_LP_SHIFT           (12U)
/*! DCDC_LP - DCDC Low Power
 *  0b1..DCDC in low-power mode
 *  0b0..DCDC in high-power mode
 */
#define PMC_PDCFGSTATUS0_DCDC_LP(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_DCDC_LP_SHIFT)) & PMC_PDCFGSTATUS0_DCDC_LP_MASK)

#define PMC_PDCFGSTATUS0_DCDC_VSEL_MASK          (0x2000U)
#define PMC_PDCFGSTATUS0_DCDC_VSEL_SHIFT         (13U)
/*! DCDC_VSEL - DCDC Voltage Selection
 *  0b1..[VSEL1] level selected
 *  0b0..[VSEL0] level selected
 */
#define PMC_PDCFGSTATUS0_DCDC_VSEL(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_DCDC_VSEL_SHIFT)) & PMC_PDCFGSTATUS0_DCDC_VSEL_MASK)

