nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_cm33_core1.h
#define PMC_PDCFGSTATUS0_LDO1_MODE_MASK          (0xC000U)
#define PMC_PDCFGSTATUS0_LDO1_MODE_SHIFT         (14U)
/*! LDO1_MODE - LDO VDD1 Regulator Mode
 *  0b10, 0b11..LDO VDD1 is in low-power mode
 *  0b01..LDO VDD1 is in high-power mode
 *  0b00..LDO VDD1 is in bypass mode
 */
#define PMC_PDCFGSTATUS0_LDO1_MODE(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_LDO1_MODE_SHIFT)) & PMC_PDCFGSTATUS0_LDO1_MODE_MASK)

#define PMC_PDCFGSTATUS0_LDO1_VSEL_MASK          (0x30000U)
#define PMC_PDCFGSTATUS0_LDO1_VSEL_SHIFT         (16U)
/*! LDO1_VSEL - LDO VDD1 Voltage Selection
 *  0b00..LDOVDD1VSEL[VSEL0] and LVDVDD1CTRL[LVL0] level selected (lowest voltage)
 *  0b01..LDOVDD1VSEL[VSEL1] and LVDVDD1CTRL[LVL1] level selected
 *  0b10..LDOVDD1VSEL[VSEL2] and LVDVDD1CTRL[LVL2] level selected
 *  0b11..LDOVDD1VSEL[VSEL3] and LVDVDD1CTRL[LVL3] level selected (highest voltage)
 */
#define PMC_PDCFGSTATUS0_LDO1_VSEL(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_LDO1_VSEL_SHIFT)) & PMC_PDCFGSTATUS0_LDO1_VSEL_MASK)

#define PMC_PDCFGSTATUS0_LDO2_MODE_MASK          (0xC0000U)
#define PMC_PDCFGSTATUS0_LDO2_MODE_SHIFT         (18U)
/*! LDO2_MODE - LDO VDD2 Regulator Mode
 *  0b10, 0b11..LDO VDD2 is in low-power mode
 *  0b01..LDO VDD2 is in high-power mode
 *  0b00..LDO VDD1 is in bypass mode
 */
#define PMC_PDCFGSTATUS0_LDO2_MODE(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_LDO2_MODE_SHIFT)) & PMC_PDCFGSTATUS0_LDO2_MODE_MASK)

#define PMC_PDCFGSTATUS0_LDO2_VSEL_MASK          (0x300000U)
#define PMC_PDCFGSTATUS0_LDO2_VSEL_SHIFT         (20U)
/*! LDO2_VSEL - LDO VDD2 Voltage Selection
 *  0b00..LDOVDD2VSEL[VSEL0] and LVDVDD2CTRL[LVL0] level selected (lowest voltage)
 *  0b01..LDOVDD2VSEL[VSEL1] and LVDVDD2CTRL[LVL1] level selected
 *  0b10..LDOVDD2VSEL[VSEL2] and LVDVDD2CTRL[LVL2] level selected
 *  0b11..LDOVDD2VSEL[VSEL3] and LVDVDD2CTRL[LVL3] level selected (highest voltage)
 */
#define PMC_PDCFGSTATUS0_LDO2_VSEL(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_LDO2_VSEL_SHIFT)) & PMC_PDCFGSTATUS0_LDO2_VSEL_MASK)

#define PMC_PDCFGSTATUS0_RBB1_PD_MASK            (0x400000U)
#define PMC_PDCFGSTATUS0_RBB1_PD_SHIFT           (22U)
/*! RBB1_PD - Power Down RBB in VDD1 domain
 *  0b0..Enables RBB if the aggregated value of [AFBB1_PD] = 1, otherwise RBB is disabled
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS0_RBB1_PD(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_RBB1_PD_SHIFT)) & PMC_PDCFGSTATUS0_RBB1_PD_MASK)

#define PMC_PDCFGSTATUS0_AFBB1_PD_MASK           (0x800000U)
#define PMC_PDCFGSTATUS0_AFBB1_PD_SHIFT          (23U)
/*! AFBB1_PD - AFBB Power Down in VDD1 domain
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS0_AFBB1_PD(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_AFBB1_PD_SHIFT)) & PMC_PDCFGSTATUS0_AFBB1_PD_MASK)

#define PMC_PDCFGSTATUS0_RBB2_PD_MASK            (0x1000000U)
#define PMC_PDCFGSTATUS0_RBB2_PD_SHIFT           (24U)
/*! RBB2_PD - RBB Power Down in VDD2 domain
 *  0b1..Power down
 *  0b0..Enables RBB if the aggregated value of [AFBB2_PD] = 1, otherwise RBB is disabled
 */
#define PMC_PDCFGSTATUS0_RBB2_PD(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_RBB2_PD_SHIFT)) & PMC_PDCFGSTATUS0_RBB2_PD_MASK)

#define PMC_PDCFGSTATUS0_AFBB2_PD_MASK           (0x2000000U)
#define PMC_PDCFGSTATUS0_AFBB2_PD_SHIFT          (25U)
/*! AFBB2_PD - AFBB Power Down in VDD2 domain
 *  0b0..Power
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS0_AFBB2_PD(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_AFBB2_PD_SHIFT)) & PMC_PDCFGSTATUS0_AFBB2_PD_MASK)

#define PMC_PDCFGSTATUS0_RBBN_PD_MASK            (0x4000000U)
#define PMC_PDCFGSTATUS0_RBBN_PD_SHIFT           (26U)
/*! RBBN_PD - RBB Power Down in VDDN domain
 *  0b0..Enables RBB if the aggregated value of [AFBBN_PD] = 1, otherwise RBB is disabled
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS0_RBBN_PD(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_RBBN_PD_SHIFT)) & PMC_PDCFGSTATUS0_RBBN_PD_MASK)

#define PMC_PDCFGSTATUS0_AFBBN_PD_MASK           (0x8000000U)
#define PMC_PDCFGSTATUS0_AFBBN_PD_SHIFT          (27U)
/*! AFBBN_PD - AFBB Power Down in VDDN domain
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS0_AFBBN_PD(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_AFBBN_PD_SHIFT)) & PMC_PDCFGSTATUS0_AFBBN_PD_MASK)

#define PMC_PDCFGSTATUS0_RBBSR1_PD_MASK          (0x10000000U)
#define PMC_PDCFGSTATUS0_RBBSR1_PD_SHIFT         (28U)
/*! RBBSR1_PD - Power Down SRAM RBB in VDD1 Domain
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS0_RBBSR1_PD(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_RBBSR1_PD_SHIFT)) & PMC_PDCFGSTATUS0_RBBSR1_PD_MASK)

#define PMC_PDCFGSTATUS0_RBBSR2_PD_MASK          (0x20000000U)
#define PMC_PDCFGSTATUS0_RBBSR2_PD_SHIFT         (29U)
/*! RBBSR2_PD - SRAM RBB Power Down in VDD2 Domain
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS0_RBBSR2_PD(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_RBBSR2_PD_SHIFT)) & PMC_PDCFGSTATUS0_RBBSR2_PD_MASK)

#define PMC_PDCFGSTATUS0_AFBBSR1_PD_MASK         (0x40000000U)
#define PMC_PDCFGSTATUS0_AFBBSR1_PD_SHIFT        (30U)
/*! AFBBSR1_PD - SRAM AFBB Power Down in VDD1 Domain
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS0_AFBBSR1_PD(x)           (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_AFBBSR1_PD_SHIFT)) & PMC_PDCFGSTATUS0_AFBBSR1_PD_MASK)

#define PMC_PDCFGSTATUS0_AFBBSR2_PD_MASK         (0x80000000U)
#define PMC_PDCFGSTATUS0_AFBBSR2_PD_SHIFT        (31U)
/*! AFBBSR2_PD - SRAM AFBB Power Down in VDD2 Domain
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS0_AFBBSR2_PD(x)           (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS0_AFBBSR2_PD_SHIFT)) & PMC_PDCFGSTATUS0_AFBBSR2_PD_MASK)
/*! @} */

/*! @name PDCFGSTATUS1 - PD Configuration Status 1 */
/*! @{ */

#define PMC_PDCFGSTATUS1_TEMP_PD_MASK            (0x1U)
#define PMC_PDCFGSTATUS1_TEMP_PD_SHIFT           (0U)
/*! TEMP_PD - PMC Temperature Sensor Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS1_TEMP_PD(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS1_TEMP_PD_SHIFT)) & PMC_PDCFGSTATUS1_TEMP_PD_MASK)

#define PMC_PDCFGSTATUS1_PMCREF_LP_MASK          (0x2U)
#define PMC_PDCFGSTATUS1_PMCREF_LP_SHIFT         (1U)
/*! PMCREF_LP - PMC References Low Power
 *  0b1..Low-power mode
 *  0b0..High-power mode
 */
#define PMC_PDCFGSTATUS1_PMCREF_LP(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS1_PMCREF_LP_SHIFT)) & PMC_PDCFGSTATUS1_PMCREF_LP_MASK)

#define PMC_PDCFGSTATUS1_HVD1V8_PD_MASK          (0x4U)
#define PMC_PDCFGSTATUS1_HVD1V8_PD_SHIFT         (2U)
/*! HVD1V8_PD - HVD Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS1_HVD1V8_PD(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS1_HVD1V8_PD_SHIFT)) & PMC_PDCFGSTATUS1_HVD1V8_PD_MASK)

#define PMC_PDCFGSTATUS1_POR1_LP_MASK            (0x8U)
#define PMC_PDCFGSTATUS1_POR1_LP_SHIFT           (3U)
/*! POR1_LP - POR Low Power in VDD1 Domain
 *  0b0..High power
 *  0b1..Low power
 */
#define PMC_PDCFGSTATUS1_POR1_LP(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS1_POR1_LP_SHIFT)) & PMC_PDCFGSTATUS1_POR1_LP_MASK)

#define PMC_PDCFGSTATUS1_LVD1_LP_MASK            (0x10U)
#define PMC_PDCFGSTATUS1_LVD1_LP_SHIFT           (4U)
/*! LVD1_LP - LVD Low Power in VDD1 Domain
 *  0b1..Low power
 *  0b0..High power
 */
#define PMC_PDCFGSTATUS1_LVD1_LP(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS1_LVD1_LP_SHIFT)) & PMC_PDCFGSTATUS1_LVD1_LP_MASK)

