nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_cm33_core1.h
#define PMC_PWRFLAGS_V2MIPIF_MASK                (0x40U)
#define PMC_PWRFLAGS_V2MIPIF_SHIFT               (6U)
/*! V2MIPIF - VDD2_MIPI Domain Flag
 *  0b1..Power-down event occurred
 *  0b0..No power-down event occurred
 */
#define PMC_PWRFLAGS_V2MIPIF(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PWRFLAGS_V2MIPIF_SHIFT)) & PMC_PWRFLAGS_V2MIPIF_MASK)

#define PMC_PWRFLAGS_V2OTPF_MASK                 (0x80U)
#define PMC_PWRFLAGS_V2OTPF_SHIFT                (7U)
/*! V2OTPF - VDD2_OTP Domain Flag
 *  0b1..Power-down event occurred
 *  0b0..No power-down event occurred
 */
#define PMC_PWRFLAGS_V2OTPF(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PWRFLAGS_V2OTPF_SHIFT)) & PMC_PWRFLAGS_V2OTPF_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group PMC_Register_Masks */


/* PMC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral PMC1 base address */
  #define PMC1_BASE                                (0x50210000u)
  /** Peripheral PMC1 base address */
  #define PMC1_BASE_NS                             (0x40210000u)
  /** Peripheral PMC1 base pointer */
  #define PMC1                                     ((PMC_Type *)PMC1_BASE)
  /** Peripheral PMC1 base pointer */
  #define PMC1_NS                                  ((PMC_Type *)PMC1_BASE_NS)
  /** Array initializer of PMC peripheral base addresses */
  #define PMC_BASE_ADDRS                           { PMC1_BASE }
  /** Array initializer of PMC peripheral base pointers */
  #define PMC_BASE_PTRS                            { PMC1 }
  /** Array initializer of PMC peripheral base addresses */
  #define PMC_BASE_ADDRS_NS                        { PMC1_BASE_NS }
  /** Array initializer of PMC peripheral base pointers */
  #define PMC_BASE_PTRS_NS                         { PMC1_NS }
#else
  /** Peripheral PMC1 base address */
  #define PMC1_BASE                                (0x40210000u)
  /** Peripheral PMC1 base pointer */
  #define PMC1                                     ((PMC_Type *)PMC1_BASE)
  /** Array initializer of PMC peripheral base addresses */
  #define PMC_BASE_ADDRS                           { PMC1_BASE }
  /** Array initializer of PMC peripheral base pointers */
  #define PMC_BASE_PTRS                            { PMC1 }
#endif

/*!
 * @}
 */ /* end of group PMC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- PVTS Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PVTS_Peripheral_Access_Layer PVTS Peripheral Access Layer
 * @{
 */

/** PVTS - Register Layout Typedef */
typedef struct {
  struct {                                         /* offset: 0x0, array step: 0x80 */
    __IO uint32_t RED_DEL_CTRL;                      /**< Red Delay Control, array offset: 0x0, array step: 0x80 */
         uint8_t RESERVED_0[8];
    __IO uint32_t RED_ALERT_CNT;                     /**< Red Alert Counter, array offset: 0xC, array step: 0x80 */
    __IO uint32_t RED_ALERT_CNT_CTRL;                /**< Red Alert Counter Control, array offset: 0x10, array step: 0x80 */
         uint8_t RESERVED_1[12];
    __IO uint32_t AMBER_DEL_CTRL;                    /**< Amber Delay Control, array offset: 0x20, array step: 0x80 */
    __IO uint32_t AMBER_RING_OSC_CTRL;               /**< Amber Ring OSC Control, array offset: 0x24, array step: 0x80 */
    __I  uint32_t AMBER_RING_CNT;                    /**< Amber Ring OSC Counter, array offset: 0x28, array step: 0x80 */
    __IO uint32_t AMBER_ALERT_CNT;                   /**< Amber Alert Counter, array offset: 0x2C, array step: 0x80 */
    __IO uint32_t AMBER_ALERT_CNT_CTRL;              /**< Amber Alert Counter Control, array offset: 0x30, array step: 0x80 */
         uint8_t RESERVED_2[76];
  } PVT[2];
} PVTS_Type;

/* ----------------------------------------------------------------------------
   -- PVTS Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PVTS_Register_Masks PVTS Register Masks
 * @{
 */

/*! @name RED_DEL_CTRL - Red Delay Control */
/*! @{ */

#define PVTS_RED_DEL_CTRL_DELAY0_MASK            (0x1FU)
#define PVTS_RED_DEL_CTRL_DELAY0_SHIFT           (0U)
/*! DELAY0 - Red Delay Section 0 */
#define PVTS_RED_DEL_CTRL_DELAY0(x)              (((uint32_t)(((uint32_t)(x)) << PVTS_RED_DEL_CTRL_DELAY0_SHIFT)) & PVTS_RED_DEL_CTRL_DELAY0_MASK)

#define PVTS_RED_DEL_CTRL_DELAY1_MASK            (0x3E0U)
#define PVTS_RED_DEL_CTRL_DELAY1_SHIFT           (5U)
/*! DELAY1 - Red Delay Section 1 */
#define PVTS_RED_DEL_CTRL_DELAY1(x)              (((uint32_t)(((uint32_t)(x)) << PVTS_RED_DEL_CTRL_DELAY1_SHIFT)) & PVTS_RED_DEL_CTRL_DELAY1_MASK)
/*! @} */

/* The count of PVTS_RED_DEL_CTRL */
#define PVTS_RED_DEL_CTRL_COUNT                  (2U)

/*! @name RED_ALERT_CNT - Red Alert Counter */
/*! @{ */

#define PVTS_RED_ALERT_CNT_CNT_MASK              (0xFFFFFU)
#define PVTS_RED_ALERT_CNT_CNT_SHIFT             (0U)
/*! CNT - Counter */
#define PVTS_RED_ALERT_CNT_CNT(x)                (((uint32_t)(((uint32_t)(x)) << PVTS_RED_ALERT_CNT_CNT_SHIFT)) & PVTS_RED_ALERT_CNT_CNT_MASK)
/*! @} */

/* The count of PVTS_RED_ALERT_CNT */
#define PVTS_RED_ALERT_CNT_COUNT                 (2U)

/*! @name RED_ALERT_CNT_CTRL - Red Alert Counter Control */
/*! @{ */

#define PVTS_RED_ALERT_CNT_CTRL_CNTEN_MASK       (0x1U)
#define PVTS_RED_ALERT_CNT_CTRL_CNTEN_SHIFT      (0U)
/*! CNTEN - Counter Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PVTS_RED_ALERT_CNT_CTRL_CNTEN(x)         (((uint32_t)(((uint32_t)(x)) << PVTS_RED_ALERT_CNT_CTRL_CNTEN_SHIFT)) & PVTS_RED_ALERT_CNT_CTRL_CNTEN_MASK)
/*! @} */

/* The count of PVTS_RED_ALERT_CNT_CTRL */
#define PVTS_RED_ALERT_CNT_CTRL_COUNT            (2U)

/*! @name AMBER_DEL_CTRL - Amber Delay Control */
/*! @{ */

#define PVTS_AMBER_DEL_CTRL_DELAY0_MASK          (0x1FU)
#define PVTS_AMBER_DEL_CTRL_DELAY0_SHIFT         (0U)
/*! DELAY0 - Amber Delay Section 0 */
#define PVTS_AMBER_DEL_CTRL_DELAY0(x)            (((uint32_t)(((uint32_t)(x)) << PVTS_AMBER_DEL_CTRL_DELAY0_SHIFT)) & PVTS_AMBER_DEL_CTRL_DELAY0_MASK)

#define PVTS_AMBER_DEL_CTRL_DELAY1_MASK          (0x3E0U)
#define PVTS_AMBER_DEL_CTRL_DELAY1_SHIFT         (5U)
/*! DELAY1 - Amber Delay Section 1 */
#define PVTS_AMBER_DEL_CTRL_DELAY1(x)            (((uint32_t)(((uint32_t)(x)) << PVTS_AMBER_DEL_CTRL_DELAY1_SHIFT)) & PVTS_AMBER_DEL_CTRL_DELAY1_MASK)
/*! @} */

/* The count of PVTS_AMBER_DEL_CTRL */
#define PVTS_AMBER_DEL_CTRL_COUNT                (2U)

/*! @name AMBER_RING_OSC_CTRL - Amber Ring OSC Control */
/*! @{ */

#define PVTS_AMBER_RING_OSC_CTRL_RINGOSCEN_MASK  (0x1U)
#define PVTS_AMBER_RING_OSC_CTRL_RINGOSCEN_SHIFT (0U)
/*! RINGOSCEN - Amber Ring Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PVTS_AMBER_RING_OSC_CTRL_RINGOSCEN(x)    (((uint32_t)(((uint32_t)(x)) << PVTS_AMBER_RING_OSC_CTRL_RINGOSCEN_SHIFT)) & PVTS_AMBER_RING_OSC_CTRL_RINGOSCEN_MASK)

#define PVTS_AMBER_RING_OSC_CTRL_CNTEN_MASK      (0x2U)
#define PVTS_AMBER_RING_OSC_CTRL_CNTEN_SHIFT     (1U)
/*! CNTEN - Amber Ring OSC Counter Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PVTS_AMBER_RING_OSC_CTRL_CNTEN(x)        (((uint32_t)(((uint32_t)(x)) << PVTS_AMBER_RING_OSC_CTRL_CNTEN_SHIFT)) & PVTS_AMBER_RING_OSC_CTRL_CNTEN_MASK)

#define PVTS_AMBER_RING_OSC_CTRL_CNTRST_MASK     (0x4U)
#define PVTS_AMBER_RING_OSC_CTRL_CNTRST_SHIFT    (2U)
/*! CNTRST - Amber Ring OSC Counter Reset
 *  0b0..Not resets
 *  0b1..Resets
 */
#define PVTS_AMBER_RING_OSC_CTRL_CNTRST(x)       (((uint32_t)(((uint32_t)(x)) << PVTS_AMBER_RING_OSC_CTRL_CNTRST_SHIFT)) & PVTS_AMBER_RING_OSC_CTRL_CNTRST_MASK)
/*! @} */

/* The count of PVTS_AMBER_RING_OSC_CTRL */
#define PVTS_AMBER_RING_OSC_CTRL_COUNT           (2U)

/*! @name AMBER_RING_CNT - Amber Ring OSC Counter */
/*! @{ */

#define PVTS_AMBER_RING_CNT_CNT_MASK             (0xFFFFFFFFU)
#define PVTS_AMBER_RING_CNT_CNT_SHIFT            (0U)
/*! CNT - Counter */
#define PVTS_AMBER_RING_CNT_CNT(x)               (((uint32_t)(((uint32_t)(x)) << PVTS_AMBER_RING_CNT_CNT_SHIFT)) & PVTS_AMBER_RING_CNT_CNT_MASK)
/*! @} */

/* The count of PVTS_AMBER_RING_CNT */
#define PVTS_AMBER_RING_CNT_COUNT                (2U)

/*! @name AMBER_ALERT_CNT - Amber Alert Counter */
/*! @{ */

