nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_cm33_core1.h
/** SDADC - Register Layout Typedef */
typedef struct {
  __I  uint32_t VERID;                             /**< Version ID, offset: 0x0 */
  __IO uint32_t ADC_CTL_0;                         /**< ADC Control 0, offset: 0x4 */
  __IO uint32_t ADC_CTL_1;                         /**< ADC Control 1, offset: 0x8 */
  __IO uint32_t ADC_CTL_2;                         /**< ADC Control 2, offset: 0xC */
  __IO uint32_t LDO_CTL;                           /**< LDO Control, offset: 0x10 */
  __IO uint32_t REF_CTL;                           /**< Reference Control, offset: 0x14 */
       uint8_t RESERVED_0[4];
  __IO uint32_t DECIMATOR_CTL_0;                   /**< Decimator Control 0, offset: 0x1C */
  __IO uint32_t DECIMATOR_CTL_1;                   /**< Decimator Control 1, offset: 0x20 */
  __IO uint32_t DECIMATOR_CTL_2;                   /**< Decimator Control 2, offset: 0x24 */
  __IO uint32_t DECIMATOR_CTL_3;                   /**< Decimator Control 3, offset: 0x28 */
  __IO uint32_t DECIMATOR_CTL_4;                   /**< Decimator Control 4, offset: 0x2C */
  __IO uint32_t DC_LOOP_CTL_0;                     /**< DC Loop Control 0, offset: 0x30 */
  __IO uint32_t DC_LOOP_CTL_1;                     /**< DC Loop Control 1, offset: 0x34 */
  __IO uint32_t FIFO_WR_RD_CTL;                    /**< FIFO Write Read Control, offset: 0x38 */
  __IO uint32_t FIFO_WATERMARK_CTL;                /**< FIFO Watermark Control, offset: 0x3C */
  __IO uint32_t FIFO_WATERMARK_ERROR_CTL;          /**< FIFO Watermark Error Control, offset: 0x40 */
  __I  uint32_t FIFO_WATERMARK_ERROR_ST;           /**< FIFO Watermark Error Status, offset: 0x44 */
  __I  uint32_t FIFO_0_P;                          /**< FIFO 0 P, offset: 0x48 */
  __I  uint32_t FIFO_0_N;                          /**< FIFO 0 N, offset: 0x4C */
  __I  uint32_t FIFO_1_P;                          /**< FIFO 1 P, offset: 0x50 */
  __I  uint32_t FIFO_1_N;                          /**< FIFO 1 N, offset: 0x54 */
  __I  uint32_t FIFO_2_P;                          /**< FIFO 2 P, offset: 0x58 */
  __I  uint32_t FIFO_2_N;                          /**< FIFO 2 N, offset: 0x5C */
  __I  uint32_t FIFO_3_P;                          /**< FIFO 3 P, offset: 0x60 */
  __I  uint32_t FIFO_3_N;                          /**< FIFO 3 N, offset: 0x64 */
       uint8_t RESERVED_1[4];
  __I  uint32_t FIFO_ENTRIES_AVAIL_0;              /**< FIFO Entries Availability 0, offset: 0x6C */
  __I  uint32_t FIFO_ENTRIES_AVAIL_1;              /**< FIFO Entries Availability 1, offset: 0x70 */
  __IO uint32_t FIFO_INTERRUPT;                    /**< FIFO Interrupt, offset: 0x74 */
} SDADC_Type;

/* ----------------------------------------------------------------------------
   -- SDADC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SDADC_Register_Masks SDADC Register Masks
 * @{
 */

/*! @name VERID - Version ID */
/*! @{ */

#define SDADC_VERID_MINOR_MASK                   (0xFF0000U)
#define SDADC_VERID_MINOR_SHIFT                  (16U)
/*! MINOR - Minor Version Number */
#define SDADC_VERID_MINOR(x)                     (((uint32_t)(((uint32_t)(x)) << SDADC_VERID_MINOR_SHIFT)) & SDADC_VERID_MINOR_MASK)

#define SDADC_VERID_MAJOR_MASK                   (0xFF000000U)
#define SDADC_VERID_MAJOR_SHIFT                  (24U)
/*! MAJOR - Major Version Number */
#define SDADC_VERID_MAJOR(x)                     (((uint32_t)(((uint32_t)(x)) << SDADC_VERID_MAJOR_SHIFT)) & SDADC_VERID_MAJOR_MASK)
/*! @} */

/*! @name ADC_CTL_0 - ADC Control 0 */
/*! @{ */

#define SDADC_ADC_CTL_0_COMP_ADCN_ENABLE_MASK    (0xFU)
#define SDADC_ADC_CTL_0_COMP_ADCN_ENABLE_SHIFT   (0U)
/*! COMP_ADCN_ENABLE - Compensation ADCn Enable
 *  0b1xxx..Enables for ADCn[3]
 *  0b0xxx..Disables for ADCn[3]
 *  0bx1xx..Enables for ADCn[2]
 *  0bx0xx..Disables for ADCn[2]
 *  0bxx1x..Enables for ADCn[1]
 *  0bxx0x..Disables for ADCn[1]
 *  0bxxx1..Enables for ADCn[0]
 *  0bxxx0..Disables for ADCn[0]
 */
#define SDADC_ADC_CTL_0_COMP_ADCN_ENABLE(x)      (((uint32_t)(((uint32_t)(x)) << SDADC_ADC_CTL_0_COMP_ADCN_ENABLE_SHIFT)) & SDADC_ADC_CTL_0_COMP_ADCN_ENABLE_MASK)

#define SDADC_ADC_CTL_0_COMP_ADCP_ENABLE_MASK    (0xF0U)
#define SDADC_ADC_CTL_0_COMP_ADCP_ENABLE_SHIFT   (4U)
/*! COMP_ADCP_ENABLE - Compensation ADCp Enable
 *  0b1xxx..Enables for ADCp[3]
 *  0b0xxx..Disables for ADCp[3]
 *  0bx1xx..Enables for ADCp[2]
 *  0bx0xx..Disables for ADCp[2]
 *  0bxx1x..Enables for ADCp[1]
 *  0bxx0x..Disables for ADCp[1]
 *  0bxxx1..Enables for ADCp[0]
 *  0bxxx0..Disables for ADCp[0]
 */
#define SDADC_ADC_CTL_0_COMP_ADCP_ENABLE(x)      (((uint32_t)(((uint32_t)(x)) << SDADC_ADC_CTL_0_COMP_ADCP_ENABLE_SHIFT)) & SDADC_ADC_CTL_0_COMP_ADCP_ENABLE_MASK)

#define SDADC_ADC_CTL_0_RST_AN_ADCN_MASK         (0xF00U)
#define SDADC_ADC_CTL_0_RST_AN_ADCN_SHIFT        (8U)
/*! RST_AN_ADCN - Reset ADCn
 *  0b0xxx..Reset for ADCn[3]
 *  0b1xxx..Operational for ADCn[3]
 *  0bx0xx..Reset for ADCn[2]
 *  0bx1xx..Operational for ADCn[2]
 *  0bxx0x..Reset for ADCn[1]
 *  0bxx1x..Operational for ADCn[1]
 *  0bxxx0..Reset for ADCn[0]
 *  0bxxx1..Operational for ADCn[0]
 */
#define SDADC_ADC_CTL_0_RST_AN_ADCN(x)           (((uint32_t)(((uint32_t)(x)) << SDADC_ADC_CTL_0_RST_AN_ADCN_SHIFT)) & SDADC_ADC_CTL_0_RST_AN_ADCN_MASK)

#define SDADC_ADC_CTL_0_RST_AN_ADCP_MASK         (0xF000U)
#define SDADC_ADC_CTL_0_RST_AN_ADCP_SHIFT        (12U)
/*! RST_AN_ADCP - Reset ADCp
 *  0b0xxx..Reset for ADCp[3]
 *  0b1xxx..Operational for ADCp[3]
 *  0bx0xx..Reset for ADCp[2]
 *  0bx1xx..Operational for ADCp[2]
 *  0bxx0x..Reset for ADCp[1]
 *  0bxx1x..Operational for ADCp[1]
 *  0bxxx0..Reset for ADCp[0]
 *  0bxxx1..Operational for ADCp[0]
 */
#define SDADC_ADC_CTL_0_RST_AN_ADCP(x)           (((uint32_t)(((uint32_t)(x)) << SDADC_ADC_CTL_0_RST_AN_ADCP_SHIFT)) & SDADC_ADC_CTL_0_RST_AN_ADCP_MASK)

#define SDADC_ADC_CTL_0_ADCN_POWER_ENABLE_MASK   (0xF000000U)
#define SDADC_ADC_CTL_0_ADCN_POWER_ENABLE_SHIFT  (24U)
/*! ADCN_POWER_ENABLE - ADCn Power Enable
 *  0b1xxx..Enables ADCn[3] and vin_n[3]
 *  0b0xxx..Disables ADCn[3] and vin_n[3]
 *  0bx1xx..Enables ADCn[2] and vin_n[2]
 *  0bx0xx..Disables ADCn[2] and vin_n[2]
 *  0bxx1x..Enables ADCn[1] and vin_n[1]
 *  0bxx0x..Disables ADCn[1] and vin_n[1]
 *  0bxxx1..Enables ADCn[0] and vin_n[0]
 *  0bxxx0..Disables ADCn[0] and vin_n[0]
 */
#define SDADC_ADC_CTL_0_ADCN_POWER_ENABLE(x)     (((uint32_t)(((uint32_t)(x)) << SDADC_ADC_CTL_0_ADCN_POWER_ENABLE_SHIFT)) & SDADC_ADC_CTL_0_ADCN_POWER_ENABLE_MASK)

