nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_cm33_core1.h
#define SLEEPCON1_RUNCFG_CLR_AUDPLLLDO_PD_MASK   (0x8000U)
#define SLEEPCON1_RUNCFG_CLR_AUDPLLLDO_PD_SHIFT  (15U)
/*! AUDPLLLDO_PD - Audio PLL Internal Regulator Power Down Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_RUNCFG_CLR_AUDPLLLDO_PD(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_RUNCFG_CLR_AUDPLLLDO_PD_SHIFT)) & SLEEPCON1_RUNCFG_CLR_AUDPLLLDO_PD_MASK)

#define SLEEPCON1_RUNCFG_CLR_ADC0_PD_MASK        (0x10000U)
#define SLEEPCON1_RUNCFG_CLR_ADC0_PD_SHIFT       (16U)
/*! ADC0_PD - ADC0 Power Down Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_RUNCFG_CLR_ADC0_PD(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_RUNCFG_CLR_ADC0_PD_SHIFT)) & SLEEPCON1_RUNCFG_CLR_ADC0_PD_MASK)

#define SLEEPCON1_RUNCFG_CLR_FRO2_GATE_MASK      (0x80000000U)
#define SLEEPCON1_RUNCFG_CLR_FRO2_GATE_SHIFT     (31U)
/*! FRO2_GATE - FRO2 Gating Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_RUNCFG_CLR_FRO2_GATE(x)        (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_RUNCFG_CLR_FRO2_GATE_SHIFT)) & SLEEPCON1_RUNCFG_CLR_FRO2_GATE_MASK)
/*! @} */

/*! @name WAKEUPEN0 - Wakeup Enable 0 */
/*! @{ */

#define SLEEPCON1_WAKEUPEN0_FRO0_MASK            (0x2U)
#define SLEEPCON1_WAKEUPEN0_FRO0_SHIFT           (1U)
/*! FRO0 - FRO0 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN0_FRO0(x)              (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_FRO0_SHIFT)) & SLEEPCON1_WAKEUPEN0_FRO0_MASK)

#define SLEEPCON1_WAKEUPEN0_FRO1_MASK            (0x4U)
#define SLEEPCON1_WAKEUPEN0_FRO1_SHIFT           (2U)
/*! FRO1 - FRO1 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN0_FRO1(x)              (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_FRO1_SHIFT)) & SLEEPCON1_WAKEUPEN0_FRO1_MASK)

#define SLEEPCON1_WAKEUPEN0_FRO2_MASK            (0x8U)
#define SLEEPCON1_WAKEUPEN0_FRO2_SHIFT           (3U)
/*! FRO2 - FRO2 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN0_FRO2(x)              (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_FRO2_SHIFT)) & SLEEPCON1_WAKEUPEN0_FRO2_MASK)

#define SLEEPCON1_WAKEUPEN0_UTICK1_MASK          (0x20U)
#define SLEEPCON1_WAKEUPEN0_UTICK1_SHIFT         (5U)
/*! UTICK1 - UTICK1 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN0_UTICK1(x)            (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_UTICK1_SHIFT)) & SLEEPCON1_WAKEUPEN0_UTICK1_MASK)

#define SLEEPCON1_WAKEUPEN0_CTIMER5_MASK         (0x80U)
#define SLEEPCON1_WAKEUPEN0_CTIMER5_SHIFT        (7U)
/*! CTIMER5 - CTIMER5 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN0_CTIMER5(x)           (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_CTIMER5_SHIFT)) & SLEEPCON1_WAKEUPEN0_CTIMER5_MASK)

#define SLEEPCON1_WAKEUPEN0_CTIMER6_MASK         (0x100U)
#define SLEEPCON1_WAKEUPEN0_CTIMER6_SHIFT        (8U)
/*! CTIMER6 - CTIMER6 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN0_CTIMER6(x)           (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_CTIMER6_SHIFT)) & SLEEPCON1_WAKEUPEN0_CTIMER6_MASK)

#define SLEEPCON1_WAKEUPEN0_CTIMER7_MASK         (0x200U)
#define SLEEPCON1_WAKEUPEN0_CTIMER7_SHIFT        (9U)
/*! CTIMER7 - CTIMER7 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN0_CTIMER7(x)           (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_CTIMER7_SHIFT)) & SLEEPCON1_WAKEUPEN0_CTIMER7_MASK)

#define SLEEPCON1_WAKEUPEN0_LPI2C15_MASK         (0x400U)
#define SLEEPCON1_WAKEUPEN0_LPI2C15_SHIFT        (10U)
/*! LPI2C15 - LPI2C15 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN0_LPI2C15(x)           (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_LPI2C15_SHIFT)) & SLEEPCON1_WAKEUPEN0_LPI2C15_MASK)

#define SLEEPCON1_WAKEUPEN0_LP_FLEXCOMM17_MASK   (0x800U)
#define SLEEPCON1_WAKEUPEN0_LP_FLEXCOMM17_SHIFT  (11U)
/*! LP_FLEXCOMM17 - LP_FLEXCOMM17 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN0_LP_FLEXCOMM17(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_LP_FLEXCOMM17_SHIFT)) & SLEEPCON1_WAKEUPEN0_LP_FLEXCOMM17_MASK)

#define SLEEPCON1_WAKEUPEN0_LP_FLEXCOMM18_MASK   (0x1000U)
#define SLEEPCON1_WAKEUPEN0_LP_FLEXCOMM18_SHIFT  (12U)
/*! LP_FLEXCOMM18 - LP_FLEXCOMM18 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN0_LP_FLEXCOMM18(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_LP_FLEXCOMM18_SHIFT)) & SLEEPCON1_WAKEUPEN0_LP_FLEXCOMM18_MASK)

#define SLEEPCON1_WAKEUPEN0_LP_FLEXCOMM19_MASK   (0x2000U)
#define SLEEPCON1_WAKEUPEN0_LP_FLEXCOMM19_SHIFT  (13U)
/*! LP_FLEXCOMM19 - LP_FLEXCOMM19 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN0_LP_FLEXCOMM19(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_LP_FLEXCOMM19_SHIFT)) & SLEEPCON1_WAKEUPEN0_LP_FLEXCOMM19_MASK)

#define SLEEPCON1_WAKEUPEN0_LP_FLEXCOMM20_MASK   (0x4000U)
#define SLEEPCON1_WAKEUPEN0_LP_FLEXCOMM20_SHIFT  (14U)
/*! LP_FLEXCOMM20 - LP_FLEXCOMM20 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN0_LP_FLEXCOMM20(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_LP_FLEXCOMM20_SHIFT)) & SLEEPCON1_WAKEUPEN0_LP_FLEXCOMM20_MASK)

#define SLEEPCON1_WAKEUPEN0_ADC0_MASK            (0x8000U)
#define SLEEPCON1_WAKEUPEN0_ADC0_SHIFT           (15U)
/*! ADC0 - ADC0 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN0_ADC0(x)              (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_ADC0_SHIFT)) & SLEEPCON1_WAKEUPEN0_ADC0_MASK)

#define SLEEPCON1_WAKEUPEN0_ACMP0_MASK           (0x40000U)
#define SLEEPCON1_WAKEUPEN0_ACMP0_SHIFT          (18U)
/*! ACMP0 - ACMP0 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN0_ACMP0(x)             (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_ACMP0_SHIFT)) & SLEEPCON1_WAKEUPEN0_ACMP0_MASK)

#define SLEEPCON1_WAKEUPEN0_MICFIL_RD_ERR_MASK   (0x80000U)
#define SLEEPCON1_WAKEUPEN0_MICFIL_RD_ERR_SHIFT  (19U)
/*! MICFIL_RD_ERR - MICFIL Read Data Error Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN0_MICFIL_RD_ERR(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_MICFIL_RD_ERR_SHIFT)) & SLEEPCON1_WAKEUPEN0_MICFIL_RD_ERR_MASK)

#define SLEEPCON1_WAKEUPEN0_MICFIL_WKUP_MASK     (0x400000U)
#define SLEEPCON1_WAKEUPEN0_MICFIL_WKUP_SHIFT    (22U)
/*! MICFIL_WKUP - MICFIL Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN0_MICFIL_WKUP(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_MICFIL_WKUP_SHIFT)) & SLEEPCON1_WAKEUPEN0_MICFIL_WKUP_MASK)

#define SLEEPCON1_WAKEUPEN0_RTC1_ALARM_MASK      (0x800000U)
#define SLEEPCON1_WAKEUPEN0_RTC1_ALARM_SHIFT     (23U)
/*! RTC1_ALARM - RTC1_ALARM Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN0_RTC1_ALARM(x)        (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_RTC1_ALARM_SHIFT)) & SLEEPCON1_WAKEUPEN0_RTC1_ALARM_MASK)

