nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_cm33_core1.h
#define SLEEPCON1_WAKEUPEN1_CLR_WWDT2_MASK       (0x10U)
#define SLEEPCON1_WAKEUPEN1_CLR_WWDT2_SHIFT      (4U)
/*! WWDT2 - WWDT2 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_WWDT2(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_WWDT2_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_WWDT2_MASK)

#define SLEEPCON1_WAKEUPEN1_CLR_WWDT3_MASK       (0x20U)
#define SLEEPCON1_WAKEUPEN1_CLR_WWDT3_SHIFT      (5U)
/*! WWDT3 - WWDT3 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_WWDT3(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_WWDT3_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_WWDT3_MASK)

#define SLEEPCON1_WAKEUPEN1_CLR_USBPHY0_MASK     (0x40U)
#define SLEEPCON1_WAKEUPEN1_CLR_USBPHY0_SHIFT    (6U)
/*! USBPHY0 - USBPHY0 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_USBPHY0(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_USBPHY0_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_USBPHY0_MASK)

#define SLEEPCON1_WAKEUPEN1_CLR_PMIC_IRQN_MASK   (0x80U)
#define SLEEPCON1_WAKEUPEN1_CLR_PMIC_IRQN_SHIFT  (7U)
/*! PMIC_IRQN - PMIC_IRQN Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_PMIC_IRQN(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_PMIC_IRQN_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_PMIC_IRQN_MASK)

#define SLEEPCON1_WAKEUPEN1_CLR_I3C3_MASK        (0x100U)
#define SLEEPCON1_WAKEUPEN1_CLR_I3C3_SHIFT       (8U)
/*! I3C3 - I3C3 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_I3C3(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_I3C3_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_I3C3_MASK)

#define SLEEPCON1_WAKEUPEN1_CLR_FLEXIO_MASK      (0x200U)
#define SLEEPCON1_WAKEUPEN1_CLR_FLEXIO_SHIFT     (9U)
/*! FLEXIO - FLEXIO Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_FLEXIO(x)        (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_FLEXIO_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_FLEXIO_MASK)

#define SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH0_MASK   (0x2000U)
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH0_SHIFT  (13U)
/*! EDMA2_CH0 - eDMA2 Channel 0 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH0(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH0_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH0_MASK)

#define SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH1_MASK   (0x4000U)
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH1_SHIFT  (14U)
/*! EDMA2_CH1 - eDMA2 Channel 1 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH1(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH1_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH1_MASK)

#define SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH2_MASK   (0x8000U)
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH2_SHIFT  (15U)
/*! EDMA2_CH2 - eDMA2 Channel 2 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH2(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH2_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH2_MASK)

#define SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH3_MASK   (0x10000U)
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH3_SHIFT  (16U)
/*! EDMA2_CH3 - eDMA2 Channel 3 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH3(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH3_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH3_MASK)

#define SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH4_MASK   (0x20000U)
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH4_SHIFT  (17U)
/*! EDMA2_CH4 - eDMA2 Channel 4 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH4(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH4_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH4_MASK)

#define SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH5_MASK   (0x40000U)
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH5_SHIFT  (18U)
/*! EDMA2_CH5 - eDMA2 Channel 5 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH5(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH5_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH5_MASK)

#define SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH6_MASK   (0x80000U)
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH6_SHIFT  (19U)
/*! EDMA2_CH6 - eDMA2 Channel 6 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH6(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH6_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH6_MASK)

#define SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH7_MASK   (0x100000U)
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH7_SHIFT  (20U)
/*! EDMA2_CH7 - eDMA2 Channel 7 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH7(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH7_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_EDMA2_CH7_MASK)

#define SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH0_MASK   (0x200000U)
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH0_SHIFT  (21U)
/*! EDMA3_CH0 - eDMA3 Channel 0 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH0(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH0_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH0_MASK)

#define SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH1_MASK   (0x400000U)
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH1_SHIFT  (22U)
/*! EDMA3_CH1 - eDMA3 Channel 1 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH1(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH1_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH1_MASK)

#define SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH2_MASK   (0x800000U)
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH2_SHIFT  (23U)
/*! EDMA3_CH2 - eDMA3 Channel 2 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH2(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH2_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH2_MASK)

