nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_cm33_core1.h
/*! @name PRIVATE_TCTRL0 - Private Resources Target Low-power Control */
/*! @{ */

#define SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM17__B_LPREQ_MASK (0x1U)
#define SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM17__B_LPREQ_SHIFT (0U)
/*! LP_FLEXCOMM17__B_LPREQ - LP_FLEXCOMM17 Bus Low-power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM17__B_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM17__B_LPREQ_SHIFT)) & SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM17__B_LPREQ_MASK)

#define SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM18__B_LPREQ_MASK (0x2U)
#define SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM18__B_LPREQ_SHIFT (1U)
/*! LP_FLEXCOMM18__B_LPREQ - LP_FLEXCOMM18 Bus Low-power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM18__B_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM18__B_LPREQ_SHIFT)) & SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM18__B_LPREQ_MASK)

#define SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM19__B_LPREQ_MASK (0x4U)
#define SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM19__B_LPREQ_SHIFT (2U)
/*! LP_FLEXCOMM19__B_LPREQ - LP_FLEXCOMM19 Bus Low-power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM19__B_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM19__B_LPREQ_SHIFT)) & SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM19__B_LPREQ_MASK)

#define SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM20__B_LPREQ_MASK (0x8U)
#define SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM20__B_LPREQ_SHIFT (3U)
/*! LP_FLEXCOMM20__B_LPREQ - LP_FLEXCOMM20 Bus Low-power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM20__B_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM20__B_LPREQ_SHIFT)) & SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM20__B_LPREQ_MASK)

#define SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM17_F_LPREQ_MASK (0x10U)
#define SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM17_F_LPREQ_SHIFT (4U)
/*! LP_FLEXCOMM17_F_LPREQ - LP_FLEXCOMM17 Function Low-power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM17_F_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM17_F_LPREQ_SHIFT)) & SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM17_F_LPREQ_MASK)

#define SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM18_F_LPREQ_MASK (0x20U)
#define SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM18_F_LPREQ_SHIFT (5U)
/*! LP_FLEXCOMM18_F_LPREQ - LP_FLEXCOMM18 Function Low-power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM18_F_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM18_F_LPREQ_SHIFT)) & SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM18_F_LPREQ_MASK)

#define SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM19_F_LPREQ_MASK (0x40U)
#define SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM19_F_LPREQ_SHIFT (6U)
/*! LP_FLEXCOMM19_F_LPREQ - LP_FLEXCOMM19 Function Low-power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM19_F_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM19_F_LPREQ_SHIFT)) & SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM19_F_LPREQ_MASK)

#define SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM20_F_LPREQ_MASK (0x80U)
#define SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM20_F_LPREQ_SHIFT (7U)
/*! LP_FLEXCOMM20_F_LPREQ - LP_FLEXCOMM20 Function Low-power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM20_F_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM20_F_LPREQ_SHIFT)) & SLEEPCON1_PRIVATE_TCTRL0_LP_FLEXCOMM20_F_LPREQ_MASK)

#define SLEEPCON1_PRIVATE_TCTRL0_SAI3_LPREQ_MASK (0x100U)
#define SLEEPCON1_PRIVATE_TCTRL0_SAI3_LPREQ_SHIFT (8U)
/*! SAI3_LPREQ - SAI3 Low-power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_PRIVATE_TCTRL0_SAI3_LPREQ(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TCTRL0_SAI3_LPREQ_SHIFT)) & SLEEPCON1_PRIVATE_TCTRL0_SAI3_LPREQ_MASK)

#define SLEEPCON1_PRIVATE_TCTRL0_GPIO8_LPREQ_MASK (0x200U)
#define SLEEPCON1_PRIVATE_TCTRL0_GPIO8_LPREQ_SHIFT (9U)
/*! GPIO8_LPREQ - GPIO8 Low-power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_PRIVATE_TCTRL0_GPIO8_LPREQ(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TCTRL0_GPIO8_LPREQ_SHIFT)) & SLEEPCON1_PRIVATE_TCTRL0_GPIO8_LPREQ_MASK)

#define SLEEPCON1_PRIVATE_TCTRL0_GPIO9_LPREQ_MASK (0x400U)
#define SLEEPCON1_PRIVATE_TCTRL0_GPIO9_LPREQ_SHIFT (10U)
/*! GPIO9_LPREQ - GPIO9 Low-power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_PRIVATE_TCTRL0_GPIO9_LPREQ(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TCTRL0_GPIO9_LPREQ_SHIFT)) & SLEEPCON1_PRIVATE_TCTRL0_GPIO9_LPREQ_MASK)

#define SLEEPCON1_PRIVATE_TCTRL0_GPIO10_LPREQ_MASK (0x800U)
#define SLEEPCON1_PRIVATE_TCTRL0_GPIO10_LPREQ_SHIFT (11U)
/*! GPIO10_LPREQ - GPIO10 Low-power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_PRIVATE_TCTRL0_GPIO10_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TCTRL0_GPIO10_LPREQ_SHIFT)) & SLEEPCON1_PRIVATE_TCTRL0_GPIO10_LPREQ_MASK)

#define SLEEPCON1_PRIVATE_TCTRL0_I3C2_STOP_MASK  (0x100000U)
#define SLEEPCON1_PRIVATE_TCTRL0_I3C2_STOP_SHIFT (20U)
/*! I3C2_STOP - I3C2 Stop
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_PRIVATE_TCTRL0_I3C2_STOP(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TCTRL0_I3C2_STOP_SHIFT)) & SLEEPCON1_PRIVATE_TCTRL0_I3C2_STOP_MASK)

#define SLEEPCON1_PRIVATE_TCTRL0_I3C3_STOP_MASK  (0x200000U)
#define SLEEPCON1_PRIVATE_TCTRL0_I3C3_STOP_SHIFT (21U)
/*! I3C3_STOP - I3C3 Stop
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_PRIVATE_TCTRL0_I3C3_STOP(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TCTRL0_I3C3_STOP_SHIFT)) & SLEEPCON1_PRIVATE_TCTRL0_I3C3_STOP_MASK)
/*! @} */

/*! @name SHA_MED_CSTAT0 - Media Domain Shared Controllers Low-power Status */
/*! @{ */

#define SLEEPCON1_SHA_MED_CSTAT0_VGPU_LPACCEPT_MASK (0x1U)
#define SLEEPCON1_SHA_MED_CSTAT0_VGPU_LPACCEPT_SHIFT (0U)
/*! VGPU_LPACCEPT - VGPU Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON1_SHA_MED_CSTAT0_VGPU_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHA_MED_CSTAT0_VGPU_LPACCEPT_SHIFT)) & SLEEPCON1_SHA_MED_CSTAT0_VGPU_LPACCEPT_MASK)

#define SLEEPCON1_SHA_MED_CSTAT0_VGPU_IDLE_MASK  (0x2U)
#define SLEEPCON1_SHA_MED_CSTAT0_VGPU_IDLE_SHIFT (1U)
/*! VGPU_IDLE - VGPU Idle Status
 *  0b0..Not in Idle status, VGPU has operation to perform.
 *  0b1..In Idle status, VGPU might accept low-power request.
 */
#define SLEEPCON1_SHA_MED_CSTAT0_VGPU_IDLE(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHA_MED_CSTAT0_VGPU_IDLE_SHIFT)) & SLEEPCON1_SHA_MED_CSTAT0_VGPU_IDLE_MASK)

#define SLEEPCON1_SHA_MED_CSTAT0_EZHV_STOP_MASK  (0x4U)
#define SLEEPCON1_SHA_MED_CSTAT0_EZHV_STOP_SHIFT (2U)
/*! EZHV_STOP - EZH-V Stop Status
 *  0b0..Not in Stop status
 *  0b1..In Stop status
 */
#define SLEEPCON1_SHA_MED_CSTAT0_EZHV_STOP(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHA_MED_CSTAT0_EZHV_STOP_SHIFT)) & SLEEPCON1_SHA_MED_CSTAT0_EZHV_STOP_MASK)

