nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_cm33_core1.h
/** SYSCON1 - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[20];
  __IO uint32_t NMISRC;                            /**< NMI Source Select, offset: 0x14 */
       uint8_t RESERVED_1[4];
  __IO uint32_t CTIMERGLOBALSTARTEN;               /**< CTIMER Global Start Enable, offset: 0x1C */
       uint8_t RESERVED_2[88];
  __IO uint32_t AHBMATPRIO;                        /**< Bus Matrix Priority, offset: 0x78 */
       uint8_t RESERVED_3[20];
  __IO uint32_t SYSTEM_STICK_CALIB;                /**< System Secure Tick Calibration, offset: 0x90 */
  __IO uint32_t SYSTEM_NSTICK_CALIB;               /**< System Non-Secure Tick Calibration, offset: 0x94 */
       uint8_t RESERVED_4[56];
  __IO uint32_t GPIO_PSYNC;                        /**< GPIO Synchronization Stages, offset: 0xD0 */
       uint8_t RESERVED_5[112];
  __IO uint32_t EDMA2_MEM_CTRL;                    /**< eDMA2 Memory Control, offset: 0x144 */
  __IO uint32_t EDMA3_MEM_CTRL;                    /**< eDMA3 Memory Control, offset: 0x148 */
       uint8_t RESERVED_6[244];
  __IO uint32_t SAI3_MCLK_CTRL;                    /**< SAI3 MCLK IO Direction Control, offset: 0x240 */
       uint8_t RESERVED_7[76];
  __IO uint32_t SENSE_DEBUG_HALTED_SEL;            /**< VDD1_SENSE Debug Halted Select, offset: 0x290 */
       uint8_t RESERVED_8[108];
  __IO uint32_t DSPSTALL;                          /**< HiFi1 DSP Stall, offset: 0x300 */
  __IO uint32_t OCDHALTONRESET;                    /**< HiFi1 OCDHaltOnReset, offset: 0x304 */
  __I  uint32_t HIFI1_GPR0;                        /**< HiFi1 General Purpose Register 0, offset: 0x308 */
       uint8_t RESERVED_9[8];
  __I  uint32_t HIFI1_GPR1;                        /**< HiFi1 General Purpose Register 1, offset: 0x314 */
  __I  uint32_t HIFI1_GPR2;                        /**< HiFi1 General Purpose Register 2, offset: 0x318 */
  __IO uint32_t DSP_VECT_REMAP;                    /**< HiFi1 DSP Vector Remap, offset: 0x31C */
       uint8_t RESERVED_10[256];
  __IO uint32_t EDMA2_EN0;                         /**< eDMA2 Request Enable 0, offset: 0x420 */
  __IO uint32_t EDMA2_EN1;                         /**< eDMA2 Request Enable 1, offset: 0x424 */
       uint8_t RESERVED_11[8];
  __IO uint32_t EDMA3_EN0;                         /**< eDMA3 Request Enable 0, offset: 0x430 */
  __IO uint32_t EDMA3_EN1;                         /**< eDMA3 Request Enable 1, offset: 0x434 */
       uint8_t RESERVED_12[496];
  __IO uint32_t I3C_ASYNC_WAKEUP_CTRL;             /**< I3C Asynchronous Wake-up Control, offset: 0x628 */
} SYSCON1_Type;

/* ----------------------------------------------------------------------------
   -- SYSCON1 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SYSCON1_Register_Masks SYSCON1 Register Masks
 * @{
 */

/*! @name NMISRC - NMI Source Select */
/*! @{ */

#define SYSCON1_NMISRC_IRQCPU1_MASK              (0xFFU)
#define SYSCON1_NMISRC_IRQCPU1_SHIFT             (0U)
/*! IRQCPU1 - The IRQ number of the interrupt that acts as the Non-Maskable Interrupt (NMI) for CPU1, if enabled by NMIENCPU1 */
#define SYSCON1_NMISRC_IRQCPU1(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON1_NMISRC_IRQCPU1_SHIFT)) & SYSCON1_NMISRC_IRQCPU1_MASK)

#define SYSCON1_NMISRC_NMIENCPU1_MASK            (0x80000000U)
#define SYSCON1_NMISRC_NMIENCPU1_SHIFT           (31U)
/*! NMIENCPU1 - Enables the Non-Maskable Interrupt (NMI) source selected by IRQCPU1
 *  0b1..Enables
 *  0b0..Disables
 */
#define SYSCON1_NMISRC_NMIENCPU1(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON1_NMISRC_NMIENCPU1_SHIFT)) & SYSCON1_NMISRC_NMIENCPU1_MASK)
/*! @} */

/*! @name CTIMERGLOBALSTARTEN - CTIMER Global Start Enable */
/*! @{ */

#define SYSCON1_CTIMERGLOBALSTARTEN_CTIMER0_CLK_EN_MASK (0x1U)
#define SYSCON1_CTIMERGLOBALSTARTEN_CTIMER0_CLK_EN_SHIFT (0U)
/*! CTIMER0_CLK_EN - CTIMER5 Function Clock Enable
 *  0b1..Enables
 *  0b0..Disables
 */
#define SYSCON1_CTIMERGLOBALSTARTEN_CTIMER0_CLK_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_CTIMERGLOBALSTARTEN_CTIMER0_CLK_EN_SHIFT)) & SYSCON1_CTIMERGLOBALSTARTEN_CTIMER0_CLK_EN_MASK)

#define SYSCON1_CTIMERGLOBALSTARTEN_CTIMER1_CLK_EN_MASK (0x2U)
#define SYSCON1_CTIMERGLOBALSTARTEN_CTIMER1_CLK_EN_SHIFT (1U)
/*! CTIMER1_CLK_EN - CTIMER6 Function Clock Enable
 *  0b1..Enables
 *  0b0..Disables
 */
#define SYSCON1_CTIMERGLOBALSTARTEN_CTIMER1_CLK_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_CTIMERGLOBALSTARTEN_CTIMER1_CLK_EN_SHIFT)) & SYSCON1_CTIMERGLOBALSTARTEN_CTIMER1_CLK_EN_MASK)

#define SYSCON1_CTIMERGLOBALSTARTEN_CTIMER2_CLK_EN_MASK (0x4U)
#define SYSCON1_CTIMERGLOBALSTARTEN_CTIMER2_CLK_EN_SHIFT (2U)
/*! CTIMER2_CLK_EN - CTIMER7 Function Clock Enable
 *  0b1..Enables
 *  0b0..Disables
 */
#define SYSCON1_CTIMERGLOBALSTARTEN_CTIMER2_CLK_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_CTIMERGLOBALSTARTEN_CTIMER2_CLK_EN_SHIFT)) & SYSCON1_CTIMERGLOBALSTARTEN_CTIMER2_CLK_EN_MASK)
/*! @} */

/*! @name AHBMATPRIO - Bus Matrix Priority */
/*! @{ */

#define SYSCON1_AHBMATPRIO_SBUS_M0_MASK          (0x3U)
#define SYSCON1_AHBMATPRIO_SBUS_M0_SHIFT         (0U)
/*! SBUS_M0 - S-Bus M0 Priority
 *  0b00..Level 0
 *  0b01..Level 1
 *  0b10..Level 2
 *  0b11..Level 3
 */
#define SYSCON1_AHBMATPRIO_SBUS_M0(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON1_AHBMATPRIO_SBUS_M0_SHIFT)) & SYSCON1_AHBMATPRIO_SBUS_M0_MASK)

#define SYSCON1_AHBMATPRIO_SBUS_M1_MASK          (0xCU)
#define SYSCON1_AHBMATPRIO_SBUS_M1_SHIFT         (2U)
/*! SBUS_M1 - S-Bus M1 Priority
 *  0b00..Level 0
 *  0b01..Level 1
 *  0b10..Level 2
 *  0b11..Level 3
 */
#define SYSCON1_AHBMATPRIO_SBUS_M1(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON1_AHBMATPRIO_SBUS_M1_SHIFT)) & SYSCON1_AHBMATPRIO_SBUS_M1_MASK)

#define SYSCON1_AHBMATPRIO_SBUS_M2_MASK          (0x30U)
#define SYSCON1_AHBMATPRIO_SBUS_M2_SHIFT         (4U)
/*! SBUS_M2 - S-Bus M2 Priority
 *  0b00..Level 0
 *  0b01..Level 1
 *  0b10..Level 2
 *  0b11..Level 3
 */
#define SYSCON1_AHBMATPRIO_SBUS_M2(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON1_AHBMATPRIO_SBUS_M2_SHIFT)) & SYSCON1_AHBMATPRIO_SBUS_M2_MASK)

#define SYSCON1_AHBMATPRIO_SBUS_M3_MASK          (0xC0U)
#define SYSCON1_AHBMATPRIO_SBUS_M3_SHIFT         (6U)
/*! SBUS_M3 - S-Bus M3 Priority
 *  0b00..Level 0
 *  0b01..Level 1
 *  0b10..Level 2
 *  0b11..Level 3
 */
#define SYSCON1_AHBMATPRIO_SBUS_M3(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON1_AHBMATPRIO_SBUS_M3_SHIFT)) & SYSCON1_AHBMATPRIO_SBUS_M3_MASK)

