nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_cm33_core1.h
#define SYSCON3_TEMPDETECT_CTRL_TEMP0_HIGH_DETECT_MASK (0x2000U)
#define SYSCON3_TEMPDETECT_CTRL_TEMP0_HIGH_DETECT_SHIFT (13U)
/*! TEMP0_HIGH_DETECT - TEMPDETECT1 High Or Low Detection
 *  0b1..Above
 *  0b0..Below
 */
#define SYSCON3_TEMPDETECT_CTRL_TEMP0_HIGH_DETECT(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_TEMPDETECT_CTRL_TEMP0_HIGH_DETECT_SHIFT)) & SYSCON3_TEMPDETECT_CTRL_TEMP0_HIGH_DETECT_MASK)

#define SYSCON3_TEMPDETECT_CTRL_INTERRUPT_CLEAR_MASK (0x80000000U)
#define SYSCON3_TEMPDETECT_CTRL_INTERRUPT_CLEAR_SHIFT (31U)
/*! INTERRUPT_CLEAR - TEMPDETECT1 Interrupt Clear
 *  0b1..Clears
 *  0b0..Not clear
 */
#define SYSCON3_TEMPDETECT_CTRL_INTERRUPT_CLEAR(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_TEMPDETECT_CTRL_INTERRUPT_CLEAR_SHIFT)) & SYSCON3_TEMPDETECT_CTRL_INTERRUPT_CLEAR_MASK)
/*! @} */

/* The count of SYSCON3_TEMPDETECT_CTRL */
#define SYSCON3_TEMPDETECT_CTRL_COUNT            (2U)

/*! @name TEMPDETECT_FLAGS - TEMPDETECT Interrupts Output */
/*! @{ */

#define SYSCON3_TEMPDETECT_FLAGS_TEMPDETECT0_MASK (0x1U)
#define SYSCON3_TEMPDETECT_FLAGS_TEMPDETECT0_SHIFT (0U)
/*! TEMPDETECT0 - TEMPDETECT0 Interrupt
 *  0b1..Interrupt
 *  0b0..No Interrupt
 */
#define SYSCON3_TEMPDETECT_FLAGS_TEMPDETECT0(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON3_TEMPDETECT_FLAGS_TEMPDETECT0_SHIFT)) & SYSCON3_TEMPDETECT_FLAGS_TEMPDETECT0_MASK)

#define SYSCON3_TEMPDETECT_FLAGS_TEMPDETECT1_MASK (0x2U)
#define SYSCON3_TEMPDETECT_FLAGS_TEMPDETECT1_SHIFT (1U)
/*! TEMPDETECT1 - TEMPDETECT1 Interrupt
 *  0b1..Interrupt
 *  0b0..No Interrupt
 */
#define SYSCON3_TEMPDETECT_FLAGS_TEMPDETECT1(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON3_TEMPDETECT_FLAGS_TEMPDETECT1_SHIFT)) & SYSCON3_TEMPDETECT_FLAGS_TEMPDETECT1_MASK)
/*! @} */

/*! @name SWD_ACCESS_CPU - CPU0 Software Debug Access..CPU1 Software Debug Access */
/*! @{ */

#define SYSCON3_SWD_ACCESS_CPU_SEC_CODE_MASK     (0xFFFFFFFFU)
#define SYSCON3_SWD_ACCESS_CPU_SEC_CODE_SHIFT    (0U)
/*! SEC_CODE - CPU SWD-AP: 12345678h
 *  0b00010010001101000101011001111000..Value to write to enable CPU SWD access. Reading back register will be read as Ah
 *  0b00000000000000000000000000000000..CPU DAP is not allowed. Reading back register will be read as 5h
 */
#define SYSCON3_SWD_ACCESS_CPU_SEC_CODE(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON3_SWD_ACCESS_CPU_SEC_CODE_SHIFT)) & SYSCON3_SWD_ACCESS_CPU_SEC_CODE_MASK)
/*! @} */

/* The count of SYSCON3_SWD_ACCESS_CPU */
#define SYSCON3_SWD_ACCESS_CPU_COUNT             (2U)

/*! @name SWD_ACCESS_APBAP - APB-AP Software Debug Access */
/*! @{ */

#define SYSCON3_SWD_ACCESS_APBAP_SEC_CODE_MASK   (0xFFFFFFFFU)
#define SYSCON3_SWD_ACCESS_APBAP_SEC_CODE_SHIFT  (0U)
/*! SEC_CODE - APB SWD-AP: 12345678h
 *  0b00010010001101000101011001111000..Value to write to enable APB SWD access. Reading back register will be read as Ah
 *  0b00000000000000000000000000000000..APB DAP is not allowed. Reading back register will be read as 5h
 */
#define SYSCON3_SWD_ACCESS_APBAP_SEC_CODE(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON3_SWD_ACCESS_APBAP_SEC_CODE_SHIFT)) & SYSCON3_SWD_ACCESS_APBAP_SEC_CODE_MASK)
/*! @} */

/*! @name SWD_ACCESS_AHBAP - AHB-AP Software Debug Access */
/*! @{ */

#define SYSCON3_SWD_ACCESS_AHBAP_SEC_CODE_MASK   (0xFFFFFFFFU)
#define SYSCON3_SWD_ACCESS_AHBAP_SEC_CODE_SHIFT  (0U)
/*! SEC_CODE - AHB SWD-AP: 12345678h
 *  0b00010010001101000101011001111000..Value to write to enable AHB SWD access. Reading back register will be read as Ah
 *  0b00000000000000000000000000000000..AHB DAP is not allowed. Reading back register will be read as 5h
 */
#define SYSCON3_SWD_ACCESS_AHBAP_SEC_CODE(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON3_SWD_ACCESS_AHBAP_SEC_CODE_SHIFT)) & SYSCON3_SWD_ACCESS_AHBAP_SEC_CODE_MASK)
/*! @} */

/*! @name TAP_ACCESS_EN - JTAG Test Access Port Enable for Chip-TAP */
/*! @{ */

#define SYSCON3_TAP_ACCESS_EN_SEC_CODE_MASK      (0xFFFFFFFFU)
#define SYSCON3_TAP_ACCESS_EN_SEC_CODE_SHIFT     (0U)
/*! SEC_CODE - JTAG Test Access Port Enable: 12345678h
 *  0b00010010001101000101011001111000..Value to write to enable JTAG TAP. Reading back register will be read as Ah
 *  0b00000000000000000000000000000000..JTAG TAP is not allowed. Reading back register will be read as 5h
 */
#define SYSCON3_TAP_ACCESS_EN_SEC_CODE(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON3_TAP_ACCESS_EN_SEC_CODE_SHIFT)) & SYSCON3_TAP_ACCESS_EN_SEC_CODE_MASK)
/*! @} */

/*! @name DEBUG_FEATURES - Cortex Debug Features Control */
/*! @{ */

#define SYSCON3_DEBUG_FEATURES_CPU0_NIDEN_MASK   (0x3U)
#define SYSCON3_DEBUG_FEATURES_CPU0_NIDEN_SHIFT  (0U)
/*! CPU0_NIDEN - CPU0 Non-Invasive Debug Control
 *  0b01..Disables
 *  0b10..Enables
 */
#define SYSCON3_DEBUG_FEATURES_CPU0_NIDEN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON3_DEBUG_FEATURES_CPU0_NIDEN_SHIFT)) & SYSCON3_DEBUG_FEATURES_CPU0_NIDEN_MASK)

#define SYSCON3_DEBUG_FEATURES_CPU0_DBGEN_MASK   (0xCU)
#define SYSCON3_DEBUG_FEATURES_CPU0_DBGEN_SHIFT  (2U)
/*! CPU0_DBGEN - CPU0 Invasive Debug Control
 *  0b01..Disables
 *  0b10..Enables
 */
#define SYSCON3_DEBUG_FEATURES_CPU0_DBGEN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON3_DEBUG_FEATURES_CPU0_DBGEN_SHIFT)) & SYSCON3_DEBUG_FEATURES_CPU0_DBGEN_MASK)

#define SYSCON3_DEBUG_FEATURES_CPU0_SPNIDEN_MASK (0x30U)
#define SYSCON3_DEBUG_FEATURES_CPU0_SPNIDEN_SHIFT (4U)
/*! CPU0_SPNIDEN - CPU0 Secure Privileged Non-Invasive Debug Control
 *  0b01..Disables
 *  0b10..Enables
 */
#define SYSCON3_DEBUG_FEATURES_CPU0_SPNIDEN(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON3_DEBUG_FEATURES_CPU0_SPNIDEN_SHIFT)) & SYSCON3_DEBUG_FEATURES_CPU0_SPNIDEN_MASK)

#define SYSCON3_DEBUG_FEATURES_CPU0_SPIDEN_MASK  (0xC0U)
#define SYSCON3_DEBUG_FEATURES_CPU0_SPIDEN_SHIFT (6U)
/*! CPU0_SPIDEN - CPU0 Secure Privileged Invasive Debug Control
 *  0b01..Disables
 *  0b10..Enables
 */
#define SYSCON3_DEBUG_FEATURES_CPU0_SPIDEN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON3_DEBUG_FEATURES_CPU0_SPIDEN_SHIFT)) & SYSCON3_DEBUG_FEATURES_CPU0_SPIDEN_MASK)

#define SYSCON3_DEBUG_FEATURES_CPU1_NIDEN_MASK   (0x300U)
#define SYSCON3_DEBUG_FEATURES_CPU1_NIDEN_SHIFT  (8U)
/*! CPU1_NIDEN - CPU1 Non-Invasive Debug Control
 *  0b01..Disables
 *  0b10..Enables
 */
#define SYSCON3_DEBUG_FEATURES_CPU1_NIDEN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON3_DEBUG_FEATURES_CPU1_NIDEN_SHIFT)) & SYSCON3_DEBUG_FEATURES_CPU1_NIDEN_MASK)

