nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_cm33_core1.h
#define SYSCON3_DEBUG_FEATURES_CPU1_DBGEN_MASK   (0xC00U)
#define SYSCON3_DEBUG_FEATURES_CPU1_DBGEN_SHIFT  (10U)
/*! CPU1_DBGEN - CPU1 Invasive Debug Control
 *  0b01..Disables
 *  0b10..Enables
 */
#define SYSCON3_DEBUG_FEATURES_CPU1_DBGEN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON3_DEBUG_FEATURES_CPU1_DBGEN_SHIFT)) & SYSCON3_DEBUG_FEATURES_CPU1_DBGEN_MASK)

#define SYSCON3_DEBUG_FEATURES_CPU1_SPNIDEN_MASK (0x3000U)
#define SYSCON3_DEBUG_FEATURES_CPU1_SPNIDEN_SHIFT (12U)
/*! CPU1_SPNIDEN - CPU1 Secure Privileged Non-Invasive Debug Control
 *  0b01..Disables
 *  0b10..Enables
 */
#define SYSCON3_DEBUG_FEATURES_CPU1_SPNIDEN(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON3_DEBUG_FEATURES_CPU1_SPNIDEN_SHIFT)) & SYSCON3_DEBUG_FEATURES_CPU1_SPNIDEN_MASK)

#define SYSCON3_DEBUG_FEATURES_CPU1_SPIDEN_MASK  (0xC000U)
#define SYSCON3_DEBUG_FEATURES_CPU1_SPIDEN_SHIFT (14U)
/*! CPU1_SPIDEN - CPU1 Secure Privileged Invasive Debug Control
 *  0b01..Disables
 *  0b10..Enables
 */
#define SYSCON3_DEBUG_FEATURES_CPU1_SPIDEN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON3_DEBUG_FEATURES_CPU1_SPIDEN_SHIFT)) & SYSCON3_DEBUG_FEATURES_CPU1_SPIDEN_MASK)

#define SYSCON3_DEBUG_FEATURES_HIFI4_NIDEN_MASK  (0x30000U)
#define SYSCON3_DEBUG_FEATURES_HIFI4_NIDEN_SHIFT (16U)
/*! HIFI4_NIDEN - HiFi4 Non-Invasive Debug Control
 *  0b01..Disables
 *  0b10..Enables
 */
#define SYSCON3_DEBUG_FEATURES_HIFI4_NIDEN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON3_DEBUG_FEATURES_HIFI4_NIDEN_SHIFT)) & SYSCON3_DEBUG_FEATURES_HIFI4_NIDEN_MASK)

#define SYSCON3_DEBUG_FEATURES_HIFI4_DBGEN_MASK  (0xC0000U)
#define SYSCON3_DEBUG_FEATURES_HIFI4_DBGEN_SHIFT (18U)
/*! HIFI4_DBGEN - HiFi4 Invasive Debug Control
 *  0b01..Disables
 *  0b10..Enables
 */
#define SYSCON3_DEBUG_FEATURES_HIFI4_DBGEN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON3_DEBUG_FEATURES_HIFI4_DBGEN_SHIFT)) & SYSCON3_DEBUG_FEATURES_HIFI4_DBGEN_MASK)

#define SYSCON3_DEBUG_FEATURES_HIFI1_NIDEN_MASK  (0x300000U)
#define SYSCON3_DEBUG_FEATURES_HIFI1_NIDEN_SHIFT (20U)
/*! HIFI1_NIDEN - HiFi1 Non-Invasive Debug Control
 *  0b01..Disables
 *  0b10..Enables
 */
#define SYSCON3_DEBUG_FEATURES_HIFI1_NIDEN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON3_DEBUG_FEATURES_HIFI1_NIDEN_SHIFT)) & SYSCON3_DEBUG_FEATURES_HIFI1_NIDEN_MASK)

#define SYSCON3_DEBUG_FEATURES_HIFI1_DBGEN_MASK  (0xC00000U)
#define SYSCON3_DEBUG_FEATURES_HIFI1_DBGEN_SHIFT (22U)
/*! HIFI1_DBGEN - HiFi1 Invasive Debug Control
 *  0b01..Disables
 *  0b10..Enables
 */
#define SYSCON3_DEBUG_FEATURES_HIFI1_DBGEN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON3_DEBUG_FEATURES_HIFI1_DBGEN_SHIFT)) & SYSCON3_DEBUG_FEATURES_HIFI1_DBGEN_MASK)

#define SYSCON3_DEBUG_FEATURES_AHBAP_DBGEN_MASK  (0x3000000U)
#define SYSCON3_DEBUG_FEATURES_AHBAP_DBGEN_SHIFT (24U)
/*! AHBAP_DBGEN - AHB-AP Invasive Debug Control
 *  0b01..Disables
 *  0b10..Enables
 */
#define SYSCON3_DEBUG_FEATURES_AHBAP_DBGEN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON3_DEBUG_FEATURES_AHBAP_DBGEN_SHIFT)) & SYSCON3_DEBUG_FEATURES_AHBAP_DBGEN_MASK)

#define SYSCON3_DEBUG_FEATURES_AHBAP_SPIDEN_MASK (0xC000000U)
#define SYSCON3_DEBUG_FEATURES_AHBAP_SPIDEN_SHIFT (26U)
/*! AHBAP_SPIDEN - AHB-AP Secure Privileged Invasive Debug Control
 *  0b01..Disables
 *  0b10..Enables
 */
#define SYSCON3_DEBUG_FEATURES_AHBAP_SPIDEN(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON3_DEBUG_FEATURES_AHBAP_SPIDEN_SHIFT)) & SYSCON3_DEBUG_FEATURES_AHBAP_SPIDEN_MASK)

#define SYSCON3_DEBUG_FEATURES_EZHV_DBGEN_MASK   (0x30000000U)
#define SYSCON3_DEBUG_FEATURES_EZHV_DBGEN_SHIFT  (28U)
/*! EZHV_DBGEN - EZH-V Invasive Debug Control
 *  0b01..Disables
 *  0b10..Enables
 */
#define SYSCON3_DEBUG_FEATURES_EZHV_DBGEN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON3_DEBUG_FEATURES_EZHV_DBGEN_SHIFT)) & SYSCON3_DEBUG_FEATURES_EZHV_DBGEN_MASK)

#define SYSCON3_DEBUG_FEATURES_CORESIGHT_EN_MASK (0xC0000000U)
#define SYSCON3_DEBUG_FEATURES_CORESIGHT_EN_SHIFT (30U)
/*! CORESIGHT_EN - CoreSight Debug Control
 *  0b01..Disables
 *  0b10..Enables
 */
#define SYSCON3_DEBUG_FEATURES_CORESIGHT_EN(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON3_DEBUG_FEATURES_CORESIGHT_EN_SHIFT)) & SYSCON3_DEBUG_FEATURES_CORESIGHT_EN_MASK)
/*! @} */

/*! @name DEBUG_FEATURES_DP - Cortex Debug Features Control */
/*! @{ */

#define SYSCON3_DEBUG_FEATURES_DP_CPU0_NIDEN_MASK (0x3U)
#define SYSCON3_DEBUG_FEATURES_DP_CPU0_NIDEN_SHIFT (0U)
/*! CPU0_NIDEN - CPU0 Non-Invasive Debug Control
 *  0b01..Disables
 *  0b10..Enables
 */
#define SYSCON3_DEBUG_FEATURES_DP_CPU0_NIDEN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON3_DEBUG_FEATURES_DP_CPU0_NIDEN_SHIFT)) & SYSCON3_DEBUG_FEATURES_DP_CPU0_NIDEN_MASK)

#define SYSCON3_DEBUG_FEATURES_DP_CPU0_DBGEN_MASK (0xCU)
#define SYSCON3_DEBUG_FEATURES_DP_CPU0_DBGEN_SHIFT (2U)
/*! CPU0_DBGEN - CPU0 Invasive Debug Control
 *  0b01..Disables
 *  0b10..Enables
 */
#define SYSCON3_DEBUG_FEATURES_DP_CPU0_DBGEN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON3_DEBUG_FEATURES_DP_CPU0_DBGEN_SHIFT)) & SYSCON3_DEBUG_FEATURES_DP_CPU0_DBGEN_MASK)

#define SYSCON3_DEBUG_FEATURES_DP_CPU0_SPNIDEN_MASK (0x30U)
#define SYSCON3_DEBUG_FEATURES_DP_CPU0_SPNIDEN_SHIFT (4U)
/*! CPU0_SPNIDEN - CPU0 Secure Privileged Non-Invasive Debug Control
 *  0b01..Disables
 *  0b10..Enables
 */
#define SYSCON3_DEBUG_FEATURES_DP_CPU0_SPNIDEN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_DEBUG_FEATURES_DP_CPU0_SPNIDEN_SHIFT)) & SYSCON3_DEBUG_FEATURES_DP_CPU0_SPNIDEN_MASK)

#define SYSCON3_DEBUG_FEATURES_DP_CPU0_SPIDEN_MASK (0xC0U)
#define SYSCON3_DEBUG_FEATURES_DP_CPU0_SPIDEN_SHIFT (6U)
/*! CPU0_SPIDEN - CPU0 Secure Privileged Invasive Debug Control
 *  0b01..Disables
 *  0b10..Enables
 */
#define SYSCON3_DEBUG_FEATURES_DP_CPU0_SPIDEN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_DEBUG_FEATURES_DP_CPU0_SPIDEN_SHIFT)) & SYSCON3_DEBUG_FEATURES_DP_CPU0_SPIDEN_MASK)

#define SYSCON3_DEBUG_FEATURES_DP_CPU1_NIDEN_MASK (0x300U)
#define SYSCON3_DEBUG_FEATURES_DP_CPU1_NIDEN_SHIFT (8U)
/*! CPU1_NIDEN - CPU1 Non-Invasive Debug Control
 *  0b01..Disables
 *  0b10..Enables
 */
#define SYSCON3_DEBUG_FEATURES_DP_CPU1_NIDEN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON3_DEBUG_FEATURES_DP_CPU1_NIDEN_SHIFT)) & SYSCON3_DEBUG_FEATURES_DP_CPU1_NIDEN_MASK)

#define SYSCON3_DEBUG_FEATURES_DP_CPU1_DBGEN_MASK (0xC00U)
#define SYSCON3_DEBUG_FEATURES_DP_CPU1_DBGEN_SHIFT (10U)
/*! CPU1_DBGEN - CPU1 Invasive Debug Control
 *  0b01..Disables
 *  0b10..Enables
 */
#define SYSCON3_DEBUG_FEATURES_DP_CPU1_DBGEN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON3_DEBUG_FEATURES_DP_CPU1_DBGEN_SHIFT)) & SYSCON3_DEBUG_FEATURES_DP_CPU1_DBGEN_MASK)

#define SYSCON3_DEBUG_FEATURES_DP_CPU1_SPNIDEN_MASK (0x3000U)
#define SYSCON3_DEBUG_FEATURES_DP_CPU1_SPNIDEN_SHIFT (12U)
/*! CPU1_SPNIDEN - CPU1 Secure Privileged Non-Invasive Debug Control
 *  0b01..Disables
 *  0b10..Enables
 */
#define SYSCON3_DEBUG_FEATURES_DP_CPU1_SPNIDEN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_DEBUG_FEATURES_DP_CPU1_SPNIDEN_SHIFT)) & SYSCON3_DEBUG_FEATURES_DP_CPU1_SPNIDEN_MASK)

